export const bubbles = {
    'year': 2019,
    'func': [
        {
            'name': 'שירותים חברתיים',
            'doc_id': 'budget/C2/2019',
            'values': {
                'בריאות': {
                    'amount': 41202754000,
                    'href': 'https://next.obudget.org/i/budget/C221/2019',
                    'doc_id': 'budget/C221/2019',
                    'explanation': '<p>משרד הבריאות עוסק בתכנון, פיקוח, רישוי ותיאום במערכת הברי' +
'אות.</p><p>במסגרת זו המשרד אחראי לקביעת הסטנדרטים המקצועיים ' +
'בכל תחומי הרפואה ולביצוע פיקוח ובקרה על קופות החולים וגופי ב' +
'ריאות נוספים במסגרת חוק ביטוח בריאות ממלכתי.  המשרד עוסק גם ' +
'בפיקוח ומפעיל באופן ישיר (כבעלים) מיטות אשפוז בבתי חולים כלל' +
'יים ובבתי חולים פסיכיאטריים וגריאטריים.</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                },
                'העברות לביטוח הלאומי': {
                    'amount': 46591376000,
                    'href': 'https://next.obudget.org/i/budget/C225/2019',
                    'doc_id': 'budget/C225/2019',
                    'explanation': '<p>הביטוח הלאומי הוא גוף סטטוטורי (גוף הפועל מכוח חוק) אשר פ' +
'ועל, כמשתמע משמו, כמוסד ביטוחי – תשלום שוטף בעת שגרה מבטיח ק' +
'בלת ההחזרים במקרה הצורך.</p><p>פרט לקצבאות הביטוחיות שמחלק ה' +
'מוסד לביטוח לאומי, באחריותו גם קצבאות שאינן ביטוחיות, והכספי' +
'ם עבורן מגיעים ישירות מאוצר המדינה. תשלומים אלו ניתנים במקרי' +
'ם בהם המדינה בחרה לתגמל אוכלוסיות מסוימות למרות שלא צברו זכו' +
'יות ביטוחיות, והביטוח הלאומי אינו אלא צינור להעברת כסף זה.</' +
'p>',
                    'explanation_source': 'ויקיפדיה'
                },
                'השכלה גבוהה': {
                    'amount': 11506233000,
                    'href': 'https://next.obudget.org/i/budget/C223/2019',
                    'doc_id': 'budget/C223/2019',
                    'explanation': '<p>מערכת ההשכלה הגבוהה בישראל כוללת מוסדות המוכרים על ידי המ' +
'ועצה להשכלה גבוהה, שהסמיכה אותם להעניק תארים אקדמיים. תקצוב ' +
'המוסדות נעשה באמצעות הוועדה לתכנון ולתקצוב (ות"ת) ועל ידי מש' +
'רד החינוך (התומך בחלק מהמכללות לחינוך). מערכת ההשכלה הגבוהה ' +
'כוללת גם מוסדות אשר אין בתקציבם השתתפות מתקציב המדינה (מוסדו' +
'ת חוץ-תקציביים).</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                },
                'חינוך': {
                    'amount': 61818361000,
                    'href': 'https://next.obudget.org/i/budget/C222/2019',
                    'doc_id': 'budget/C222/2019',
                    'explanation': '<p>משרד החינוך אחראי להקניית ידע לילדים וזכאים לחינוך בהתאם ' +
'לחוק לימוד חובה. המשרד אחראי לקידום המצוינות, לשיפור ההישגים' +
' ולרמת האיכות החינוכית, תוך צמצום הפערים החברתיים ; ליצירת מ' +
'ערכת חינוך אפקטיבית ויעילה שתשרת את צורכי הפרט ואת צרכיה המש' +
'תנים של מדינת ישראל; ולקידום ערכים ציוניים, יהודיים, דמוקרטי' +
'ים וחברתיים.</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                },
                'מדע, תרבות וספורט': {
                    'amount': 2227473000,
                    'href': 'https://next.obudget.org/i/budget/C226/2019',
                    'doc_id': 'budget/C226/2019',
                    'explanation': '<p>משרד המדע, הטכנולוגיה והחלל פועל לקביעת מדיניות ולקידום, ' +
'חיזוק והקמת תשתית בתחום המדע והטכנולוגיה.</p><p>משרד התרבות ' +
'והספורט פועל לקביעת מדיניות ולקידום, לחיזוק ולהקמת תשתית בשנ' +
'י התחומים העיקריים שבסמכותו: התרבות והספורט.</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                },
                'קליטת עליה': {
                    'amount': 1740631000,
                    'href': 'https://next.obudget.org/i/budget/C227/2019',
                    'doc_id': 'budget/C227/2019',
                    'explanation': null,
                    'explanation_source': 'צוות מפתח התקציב'
                },
                'רווחה': {
                    'amount': 12641622000,
                    'href': 'https://next.obudget.org/i/budget/C224/2019',
                    'doc_id': 'budget/C224/2019',
                    'explanation': '<p>משרד הרווחה משמש חולייה מרכזית בהתוויית מדיניות הרווחה בי' +
'שראל והוא אחראי לקביעת הסטנדרטים של שירותי הרווחה, להערכה ומ' +
'חקר של השירותים החברתיים ולתקצוב, פיקוח ובקרה של אספקת שירות' +
'י הרווחה וברשויות המקומיות, אשר באמצעותן מסופקים מרבית שירות' +
'י הרווחה.</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                },
                'תעסוקה': {
                    'amount': 3562689000,
                    'href': 'https://next.obudget.org/i/budget/C228/2019',
                    'doc_id': 'budget/C228/2019',
                    'explanation': null,
                    'explanation_source': null
                }
            },
            'amount': 181291139000,
            'percent': 45.70316130705783,
            'scale': 1
        },
        {
            'name': 'בטחון וסדר ציבורי',
            'doc_id': 'budget/C1/2019',
            'values': {
                'בטחון': {
                    'amount': 55158762000,
                    'href': 'https://next.obudget.org/i/budget/C111/2019',
                    'doc_id': 'budget/C111/2019',
                    'explanation': '<p>שיעור תקציב הבטחון מהתמ"ג גבוה בישראל מאשר במדינות אירופה' +
' וארה"ב, אולם הוא נמצא בתוואי יורד בשנים האחרונות, וכך גם הא' +
'חוז שהוא מהווה מההוצאה הממשלתית.</p><p>באירועים חריגים בעבר ' +
'נוספו לתקציב המשרד תוספות בגין עלויות לחימה (כמו, למשל, במלח' +
'מת לבנון השניה או מבצע "עופרת יצוקה").</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                },
                'בטחון פנים': {
                    'amount': 18833008000,
                    'href': 'https://next.obudget.org/i/budget/C112/2019',
                    'doc_id': 'budget/C112/2019',
                    'explanation': '<p>המשרד לביטחון פנים הוא גוף מטה משולב האחראי לאכיפת החוק, ' +
'לשמירת הסדר הציבורי ולפעילות בתחומים השונים של ביטחון הפנים ' +
'במדינת ישראל.</p><p>המשרד פועל, בין היתר, באמצעות משטרת ישרא' +
'ל, שירות בתי הסוהר, הרשות הלאומית לכבאות והצלחה, הרשות להגנה' +
' על עדים, הרשות הלאומית למלחמה בסמים ובאלכוהול וגופים נוספים' +
'.</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                },
                'בטחון-אחר': {
                    'amount': 13300719000,
                    'href': 'https://next.obudget.org/i/budget/C113/2019',
                    'doc_id': 'budget/C113/2019',
                    'explanation': null,
                    'explanation_source': 'צוות מפתח התקציב'
                }
            },
            'amount': 87292489000,
            'percent': 22.00627525243565,
            'scale': 0.6939052122039798
        },
        {
            'name': 'החזרי חוב',
            'doc_id': 'budget/C6/2019',
            'values': {
                'קרן': {
                    'amount': 9881000000,
                    'href': 'https://next.obudget.org/i/budget/C662/2019',
                    'doc_id': 'budget/C662/2019',
                    'explanation': '<p>החוב של מדינת ישראל "ממוחזר" כל שנה. כלומר חוב ישן מגיע ל' +
'פירעון ועל מנת לפרוע אותו מדינת ישראל לוקחת חוב חדש וכך בעצם' +
' ממחזרת את החוב. סעיף זה מציין את היקף אגרות החוב הממשלתיות ' +
'שמגיעות לתאריך פרעונן.</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                },
                'ריבית': {
                    'amount': 39126000000,
                    'href': 'https://next.obudget.org/i/budget/C661/2019',
                    'doc_id': 'budget/C661/2019',
                    'explanation': '<p>אלו תשלומי הריבית השוטפים שממשלת ישראל משלמת כל שנה על הח' +
'וב שלה. סעיף זה כולל את התשלום על מלוות הפנים (חוב שנלקח מאז' +
'רחי מדינת ישראל) ומלוות החוץ (חוב שנלקח מאזרחי העולם).</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                }
            },
            'amount': 49007000000,
            'percent': 12.354574186744909,
            'scale': 0.5199250833006862
        },
        {
            'name': 'תשתיות',
            'doc_id': 'budget/C3/2019',
            'values': {
                'אנרגיה': {
                    'amount': 619189000,
                    'href': 'https://next.obudget.org/i/budget/C333/2019',
                    'doc_id': 'budget/C333/2019',
                    'explanation': '<p>משרד התשתיות הלאומיות, האנרגיה והמים מופקד, בין היתר, על ' +
'תכנונה ועל ביצועה של המדיניות הלאומית בתחום האנרגיה, המים ות' +
'שתית משאבי הטבע במדינת ישראל.</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                },
                'בינוי ושיכון': {
                    'amount': 4981693000,
                    'href': 'https://next.obudget.org/i/budget/C334/2019',
                    'doc_id': 'budget/C334/2019',
                    'explanation': '<p>משרד הבינוי והשיכון פועל בשני מישורים בתחום הדיור: ליצור ' +
'תנאים להרחבת היצע הדיור בדרך שתאפשר מתן מענה לביקוש, סיוע בד' +
'יור מכּוון לתמיכה בזכאים מקרב אוכלוסיות חלשות.</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                },
                'משק המים': {
                    'amount': 1008185000,
                    'href': 'https://next.obudget.org/i/budget/C332/2019',
                    'doc_id': 'budget/C332/2019',
                    'explanation': '<p>הרשות הממשלתית למיום ולביוב אמונה על ניהול משק המים, ובכל' +
'ל זה על קביעת כללים לאסדרת המשק וכן על הקצאת המשאבים בתחום. ' +
'מדיניות משק המים נתונה בידי מועצה (מועצת רשות המים) המורכבת ' +
'מנציגי משרדי ממשלה בכירים ומנציגי הציבור. בסמכות מועצת רשות ' +
'המים לקבוע את חקיקת המשנה לפעילות הרשות בנושאים רבים, ביניהם' +
' אסדרת משק המים וקביעת תעריפים.</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                },
                'תחבורה': {
                    'amount': 20747055000,
                    'href': 'https://next.obudget.org/i/budget/C331/2019',
                    'doc_id': 'budget/C331/2019',
                    'explanation': '<p>משרד התחבורה אחראי לפיתוח ולהסדרה של מערכות התחבורה היבשת' +
'ית, האווירית והימית בישראל.</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                }
            },
            'amount': 27356122000,
            'percent': 6.896427830935265,
            'scale': 0.3884534448559927
        },
        {
            'name': 'הוצאות אחרות',
            'doc_id': 'budget/C7/2019',
            'values': {
                'גמלאות': {
                    'amount': 17312667000,
                    'href': 'https://next.obudget.org/i/budget/C771/2019',
                    'doc_id': 'budget/C771/2019',
                    'explanation': '<p>החבות האקטוארית החשבונאית של המדינה בגין הגמלאים ועובדי ה' +
'מדינה הפעילים, לרבות משרתי הקבע, שוטרים, סוהרים ועובדי הוראה' +
'.</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                },
                'הוצאות שונות': {
                    'amount': 7764386000,
                    'href': 'https://next.obudget.org/i/budget/C772/2019',
                    'doc_id': 'budget/C772/2019',
                    'explanation': '<p>סעיף סל שמרכז הוצאות שונות של הממשלה על מגוון נושאים. בין' +
' שאר הנושאים אפשר לציין השקעה בפרויקטי מחשוב רוחביים,  מימון' +
' תכניות הבראה לגופים ציבוריים, תקציבים לרשויות הפיקוח ממשלתי' +
'ות עצמאיות ועוד.</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                },
                'רזרבה': {
                    'amount': 0,
                    'href': 'https://next.obudget.org/i/budget/C773/2019',
                    'doc_id': 'budget/C773/2019',
                    'explanation': '<p>על ידי סעיף זה הממשלה שומרת לעצמה כסף בצד להוצאות לא צפוי' +
'ות. שימו לב שבשנים של תקציב דו שנתי נשמרת רזרבה גם למקרה שהת' +
'חזיות הכלכליות, שנעשו שנתיים מראש, יתגלו כלא מדויקות.</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                }
            },
            'amount': 25077053000,
            'percent': 6.321878745351357,
            'scale': 0.37192036565327696
        },
        {
            'name': 'משרדי מטה',
            'doc_id': 'budget/C4/2019',
            'values': {
                'אוצר': {
                    'amount': 3388364000,
                    'href': 'https://next.obudget.org/i/budget/C442/2019',
                    'doc_id': 'budget/C442/2019',
                    'explanation': '<p>משרד האוצר נחלק למשרד הראשי ולרשות המסים בישראל.</p><p>הי' +
'חידות העיקריות של המשרד הראשי הן</p><p>1. אגף התקציבים, שמכי' +
'ן את תקציב המדינה ומפקח עליו;</p><p>2. האגף לשכר ולהסכמי עבו' +
'דה, המבצע הסכמי עבודה במשק;</p><p>3. אגף הכלכלן הראשי.</p><p' +
'>רשות המסים אחראית לגביית המסים הישירים והעקיפים.</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                },
                'חוץ': {
                    'amount': 1385358000,
                    'href': 'https://next.obudget.org/i/budget/C444/2019',
                    'doc_id': 'budget/C444/2019',
                    'explanation': '<p>משרד החוץ מופקד על גיבוש מדיניות החוץ של ממשלת ישראל ועל ' +
'ביצועה בקרב מדינות המקיימות יחסים דיפלומטיים עם מדינת ישראל.' +
'  המשרד מטפל גם בשמירת זכויותיהם של האזרחים הישראלים השוהים ' +
'בחו"ל ומסייע להם באמצעות נציגויותיו בחו"ל.</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                },
                'משפטים': {
                    'amount': 3863602000,
                    'href': 'https://next.obudget.org/i/budget/C443/2019',
                    'doc_id': 'budget/C443/2019',
                    'explanation': '<p>משרד המשפטים אחראי על מספר גדול של יחידות, ביניהן: הנהלת ' +
'בתי המשפט, האגך לרישום והסדר מקרקעין, פרקליטות המדינה, הסנגו' +
'ריה הציבורית, האפוטרופוס הכללי, רשות האכיפה והגבייה (המורכבת' +
' מההוצאה לפועל ומהמרכז לגביית קנסות), בתי דין שונים ויחידות ' +
'וגופים נוספים.</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                },
                'משרדים נוספים': {
                    'amount': 1964928000,
                    'href': 'https://next.obudget.org/i/budget/C446/2019',
                    'doc_id': 'budget/C446/2019',
                    'explanation': null,
                    'explanation_source': null
                },
                'פנים ושלטון מקומי': {
                    'amount': 6877480000,
                    'href': 'https://next.obudget.org/i/budget/C445/2019',
                    'doc_id': 'budget/C445/2019',
                    'explanation': '<p>משרד הפנים אחראי מטעם הממשלה לנושאים הבאים:</p><li>פיקוח ' +
'על הרשויות המקומיות והכוונת פעולותיהן.</li><li>ארגון וניהול ' +
'הבחירות לרשויות המקומיות.</li><li>פיקוח על אתרי הרחצה ועל רי' +
'שוי עסקים.</li><li>היערכות לשעת חירום ברשויות המקומיות.</li>' +
'<li>מתן שירותי דת וסיוע בשיפוץ ובפיתוח של מבני דת לעדות הלא ' +
'יהודיות.</li><li>שמירה על המאגר הביומטרי.</li>',
                    'explanation_source': 'צוות מפתח התקציב'
                },
                'ראש הממשלה': {
                    'amount': 2493290000,
                    'href': 'https://next.obudget.org/i/budget/C441/2019',
                    'doc_id': 'budget/C441/2019',
                    'explanation': '<p>משרד ראש הממשלה כולל את היחידות הגופים והתחומים הכפופים י' +
'שירות לאחריות ראש הממשלה ויחידות וגופים עצמאיים בקביעת תכניו' +
'ת העבודה שלהם וניהול התקציב.</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                },
                'שירותי דת': {
                    'amount': 736253000,
                    'href': 'https://next.obudget.org/i/budget/C447/2019',
                    'doc_id': 'budget/C447/2019',
                    'explanation': '<p>עד לשנת 2016 המשרד לשירותי דת היה מתוקצב כחלק מתקציב משרד' +
' ראש הממשלה. החל משנה זו המשרד מתוקצב בסעיף תקציבי נפרד, הכו' +
'לל את המשרד ואת יחידות הסמך הכפופות לו: הרבנות הראשית ובתי ה' +
'דין הרבניים.</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                }
            },
            'amount': 20709275000,
            'percent': 5.22076997859901,
            'scale': 0.3379824570345633
        },
        {
            'name': 'ענפי משק',
            'doc_id': 'budget/C5/2019',
            'values': {
                'הגנת הסביבה': {
                    'amount': 373333000,
                    'href': 'https://next.obudget.org/i/budget/C554/2019',
                    'doc_id': 'budget/C554/2019',
                    'explanation': '<p>המשרד להגנת הסביבה פועל להתוויה של מדיניות סביבתית וכן מק' +
'דם הליכי תקינה בתחום.</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                },
                'חקלאות': {
                    'amount': 1910183000,
                    'href': 'https://next.obudget.org/i/budget/C552/2019',
                    'doc_id': 'budget/C552/2019',
                    'explanation': '<p>משרד החקלאות ופיתוח הכפר אחראי מטעם הממשלה לחקלאות ולמרחב' +
' הכפרי בישראל.</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                },
                'כלכלה ותעשיה': {
                    'amount': 2927470000,
                    'href': 'https://next.obudget.org/i/budget/C553/2019',
                    'doc_id': 'budget/C553/2019',
                    'explanation': '<p>משרד הכלכלה והתעשייה מופקד על עידוד ענפי התעשייה והמסחר, ' +
'לרבות עסקים קטנים ובינוניים וקידום סחר החוץ וכן על יישום מדי' +
'ניות הממשלה להפחתת יוקר המחיה ולהגברת התחרות במשק.</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                },
                'תיירות': {
                    'amount': 649184000,
                    'href': 'https://next.obudget.org/i/budget/C551/2019',
                    'doc_id': 'budget/C551/2019',
                    'explanation': '<p>משרד התיירות ממונה על קידום ושיווק תנועת התיירות לישראל, ' +
'מקיים פיקוח על שירותי התיירות: בתי מלון, אכסניות ובתי הארחה ' +
'ואחראי על הכשרת כוח האדם ועל רישוי פרטים וגופים מסחריים העוס' +
'קים בענף. כמו כן הוא מרכז את איסוף ופרסום הנתונים הסטטיסטיים' +
' בחקר תנועת התיירות אל ישראל ובתוכה, לצורך לימוד והסקת מסקנו' +
'ת אסטרטגיות, וזאת בראיית התיירות כענף כלכלי מרכזי במדינת ישר' +
'אל וכמקור הכנסה חשוב של מטבע חוץ.</p>',
                    'explanation_source': 'ויקיפדיה'
                },
                'תקשורת': {
                    'amount': 77647000,
                    'href': 'https://next.obudget.org/i/budget/C555/2019',
                    'doc_id': 'budget/C555/2019',
                    'explanation': '<p>משרד התקשורת משמש גוף האחראי לאסדרת ענף תקשורת ולפיקוח על' +
' הגופים הפועלים בו. המשרד אחראי ליישום מדיניות הממשלה בנושא ' +
'התקשורת ולקביעת הכללים שבמסגרתם פועלים הגופים בענף, על תחומי' +
'ו השונים.</p>',
                    'explanation_source': 'צוות מפתח התקציב'
                }
            },
            'amount': 5937817000,
            'percent': 1.4969126988759789,
            'scale': 0.1809777212729364
        }
    ],
    'econ': [
        {
            'name': 'העברות',
            'doc_id': 'budget/C003/2019',
            'values': {
                'העברות לארגונים ומדינות זרות': {
                    'amount': 7000000,
                    'href': 'https://next.obudget.org/i/budget/E003190/2019'
                },
                'מוצרים ציבוריים': {
                    'amount': 54103757000,
                    'href': 'https://next.obudget.org/i/budget/E003031/2019'
                },
                'סובסידיה': {
                    'amount': 9063621000,
                    'href': 'https://next.obudget.org/i/budget/E003038/2019'
                },
                'רזרבה': {
                    'amount': 7305696000,
                    'href': 'https://next.obudget.org/i/budget/E003036/2019'
                },
                'שכר עקיף': {
                    'amount': 26187476000,
                    'href': 'https://next.obudget.org/i/budget/E003029/2019'
                },
                'תמיכות לפי סעיף 3א': {
                    'amount': 2695837000,
                    'href': 'https://next.obudget.org/i/budget/E003035/2019'
                },
                'תשלומי העברה סוציאליים': {
                    'amount': 67587447000,
                    'href': 'https://next.obudget.org/i/budget/E003034/2019'
                }
            },
            'amount': 166950834000,
            'percent': 42.07879786795672,
            'scale': 1
        },
        {
            'name': 'שכר',
            'doc_id': 'budget/C001/2019',
            'values': {
                'רזרבה': {
                    'amount': 2565342000,
                    'href': 'https://next.obudget.org/i/budget/E001104/2019'
                },
                'שכר בארץ': {
                    'amount': 88792625000,
                    'href': 'https://next.obudget.org/i/budget/E001030/2019'
                },
                'שכר בחו"ל': {
                    'amount': 654570000,
                    'href': 'https://next.obudget.org/i/budget/E001185/2019'
                }
            },
            'amount': 92012537000,
            'percent': 23.191120720851803,
            'scale': 0.7423850306346981
        },
        {
            'name': 'קניות',
            'doc_id': 'budget/C002/2019',
            'values': {
                'קניות בארץ': {
                    'amount': 56214517000,
                    'href': 'https://next.obudget.org/i/budget/E002033/2019'
                },
                'קניות בחו"ל': {
                    'amount': 1738980000,
                    'href': 'https://next.obudget.org/i/budget/E002198/2019'
                },
                'רזרבה': {
                    'amount': 4591871000,
                    'href': 'https://next.obudget.org/i/budget/E002173/2019'
                }
            },
            'amount': 62545368000,
            'percent': 15.764125488878772,
            'scale': 0.612073080978248
        },
        {
            'name': 'החזר חוב - ריבית',
            'doc_id': 'budget/C015/2019',
            'values': {
                'החזר ריבית בארץ': {
                    'amount': 33718000000,
                    'href': 'https://next.obudget.org/i/budget/E015209/2019'
                },
                'החזר ריבית בחו"ל': {
                    'amount': 5408000000,
                    'href': 'https://next.obudget.org/i/budget/E015210/2019'
                }
            },
            'amount': 39126000000,
            'percent': 9.861436483639698,
            'scale': 0.48410372996306117
        },
        {
            'name': 'השקעה',
            'doc_id': 'budget/C007/2019',
            'values': {
                'השקעה בארץ': {
                    'amount': 20004127000,
                    'href': 'https://next.obudget.org/i/budget/E007047/2019'
                },
                'השקעה בחו"ל': {
                    'amount': 236023000,
                    'href': 'https://next.obudget.org/i/budget/E007048/2019'
                },
                'רזרבה': {
                    'amount': 4239339000,
                    'href': 'https://next.obudget.org/i/budget/E007044/2019'
                }
            },
            'amount': 24479489000,
            'percent': 6.16988513841069,
            'scale': 0.3829189659577944
        },
        {
            'name': 'אחרים',
            'values': {
                'החזר קרן בחו"ל': {
                    'amount': 9881000000,
                    'href': 'https://next.obudget.org/i/budget/E017226/2019'
                }
            },
            'amount': 9881000000,
            'percent': 2.4904374046629827
        }
    ],
    'income': [
        {
            'name': 'מס הכנסה',
            'values': {
                'מס הכנסה סקטור עסקי': {
                    'amount': 86542347000,
                    'href': 'https://next.obudget.org/i/budget/00000103/2019'
                },
                'מס הכנסה שכירים': {
                    'amount': 55172653000,
                    'href': 'https://next.obudget.org/i/budget/00000102/2019'
                }
            },
            'amount': 141715000000,
            'percent': 39.72723704866562,
            'scale': 1
        },
        {
            'name': 'תקבולי מע"מ ברוטו',
            'values': {
                'תקבולי מע"מ נטו': {
                    'amount': 104360652000,
                    'href': 'https://next.obudget.org/i/budget/00001402/2019'
                }
            },
            'amount': 104360652000,
            'percent': 29.255621215519174,
            'scale': 0.8581446144876141
        },
        {
            'name': 'מלוה מהמוסד לבטוח לאומי',
            'values': {
                'מלוה מהמוסד לבטוח לאומי': {
                    'amount': 23818000000,
                    'href': 'https://next.obudget.org/i/budget/00008101/2019'
                }
            },
            'amount': 23818000000,
            'percent': 6.676945503476116,
            'scale': 0.4099630683251082
        },
        {
            'name': 'מס דלק',
            'values': {
                'מס דלק': {
                    'amount': 21090000000,
                    'href': 'https://next.obudget.org/i/budget/00001801/2019'
                }
            },
            'amount': 21090000000,
            'percent': 5.9122000448531065,
            'scale': 0.38577171282541955
        },
        {
            'name': 'מס קניה',
            'values': {
                'מס קניה מוצרי יבוא': {
                    'amount': 16890000000,
                    'href': 'https://next.obudget.org/i/budget/00001302/2019'
                },
                'מס קניה מקומי': {
                    'amount': 930000000,
                    'href': 'https://next.obudget.org/i/budget/00001303/2019'
                }
            },
            'amount': 17820000000,
            'percent': 4.995514689392241,
            'scale': 0.3546058853782455
        },
        {
            'name': 'מיסים על הוצאות שכר',
            'values': {
                'מע"מ על מלכרים': {
                    'amount': 12591310000,
                    'href': 'https://next.obudget.org/i/budget/00000202/2019'
                },
                'מע"מ על פיננסים': {
                    'amount': 3183021000,
                    'href': 'https://next.obudget.org/i/budget/00000203/2019'
                }
            },
            'amount': 15774331000,
            'percent': 4.422048385288181,
            'scale': 0.3336318965385222
        },
        {
            'name': 'אחרים',
            'values': {
                'מס רכישה': {
                    'amount': 8900000000,
                    'href': 'https://next.obudget.org/i/budget/00000401/2019'
                },
                'אגרות': {
                    'amount': 6650000000,
                    'href': 'https://next.obudget.org/i/budget/00002507/2019'
                },
                'מס שבח': {
                    'amount': 5100000000,
                    'href': 'https://next.obudget.org/i/budget/00000301/2019'
                },
                'דוידנדים מחברות ממשלתיו': {
                    'amount': 3412000000,
                    'href': 'https://next.obudget.org/i/budget/00004501/2019'
                },
                'מכס והיטל על היבוא': {
                    'amount': 2900000000,
                    'href': 'https://next.obudget.org/i/budget/00001101/2019'
                }
            },
            'amount': 26962000000,
            'percent': 7.558309037900874
        }
    ],
    'deficitChart': {
        'budget': 396670895000,
        'expenseChildren': [
            {
                'code': '0001',
                'net_allocated': 51180000,
                'net_revised': 51180000,
                'title': 'נשיא המדינה ולשכתו'
            },
            {
                'code': '0002',
                'net_allocated': 795250000,
                'net_revised': 795250000,
                'title': 'הכנסת'
            },
            {
                'code': '0004',
                'net_allocated': 2440926000,
                'net_revised': 2440926000,
                'title': 'משרד ראש הממשלה'
            },
            {
                'code': '0005',
                'net_allocated': 2750852000,
                'net_revised': 2750852000,
                'title': 'משרד האוצר'
            },
            {
                'code': '0006',
                'net_allocated': 438326000,
                'net_revised': 438326000,
                'title': 'משרד הפנים'
            },
            {
                'code': '0007',
                'net_allocated': 18299433000,
                'net_revised': 18299433000,
                'title': 'משרד לביטחון פנים'
            },
            {
                'code': '0008',
                'net_allocated': 3766297000,
                'net_revised': 3766297000,
                'title': 'משרד המשפטים'
            },
            {
                'code': '0009',
                'net_allocated': 1385358000,
                'net_revised': 1385358000,
                'title': 'משרד החוץ'
            },
            {
                'code': '0010',
                'net_allocated': 52364000,
                'net_revised': 52364000,
                'title': 'מטה לביטחון לאומי'
            },
            {
                'code': '0011',
                'net_allocated': 381796000,
                'net_revised': 381796000,
                'title': 'מבקר המדינה'
            },
            {
                'code': '0012',
                'net_allocated': 17312667000,
                'net_revised': 17312667000,
                'title': 'גמלאות ופיצויים'
            },
            {
                'code': '0013',
                'net_allocated': 3492418000,
                'net_revised': 3492418000,
                'title': 'הוצאות שונות'
            },
            {
                'code': '0014',
                'net_allocated': 736702000,
                'net_revised': 736702000,
                'title': 'בחירות ומימון מפלגות'
            },
            {
                'code': '0015',
                'net_allocated': 55158762000,
                'net_revised': 55158762000,
                'title': 'משרד הבטחון'
            },
            {
                'code': '0016',
                'net_allocated': 490052000,
                'net_revised': 490052000,
                'title': 'הוצאות חירום אזרחיות'
            },
            {
                'code': '0017',
                'net_allocated': 115953000,
                'net_revised': 115953000,
                'title': 'תאום הפעולות בשטחים'
            },
            {
                'code': '0018',
                'net_allocated': 5629202000,
                'net_revised': 5629202000,
                'title': 'רשויות מקומיות'
            },
            {
                'code': '0019',
                'net_allocated': 2227473000,
                'net_revised': 2227473000,
                'title': 'משרד המדע והחלל, התרבות'
            },
            {
                'code': '0020',
                'net_allocated': 60456672000,
                'net_revised': 60456672000,
                'title': 'משרד החינוך'
            },
            {
                'code': '0021',
                'net_allocated': 11506233000,
                'net_revised': 11506233000,
                'title': 'השכלה גבוהה'
            },
            {
                'code': '0022',
                'net_allocated': 736253000,
                'net_revised': 736253000,
                'title': 'המשרד לשירותי דת'
            },
            {
                'code': '0023',
                'net_allocated': 7772516000,
                'net_revised': 7772516000,
                'title': 'משרד הרווחה והשירותים'
            },
            {
                'code': '0024',
                'net_allocated': 37984845000,
                'net_revised': 37984845000,
                'title': 'משרד הבריאות'
            },
            {
                'code': '0025',
                'net_allocated': 4869106000,
                'net_revised': 4869106000,
                'title': 'תגמולים לנכים'
            },
            {
                'code': '0026',
                'net_allocated': 373333000,
                'net_revised': 373333000,
                'title': 'המשרד להגנת הסביבה'
            },
            {
                'code': '0027',
                'net_allocated': 46591376000,
                'net_revised': 46591376000,
                'title': 'ביטוח לאומי'
            },
            {
                'code': '0029',
                'net_allocated': 261198000,
                'net_revised': 261198000,
                'title': 'משרד הבינוי והשיכון'
            },
            {
                'code': '0030',
                'net_allocated': 1740631000,
                'net_revised': 1740631000,
                'title': 'המשרד לקליטת העליה'
            },
            {
                'code': '0031',
                'net_allocated': 10185077000,
                'net_revised': 10185077000,
                'title': 'הוצאות ביטחוניות שונות'
            },
            {
                'code': '0033',
                'net_allocated': 1910183000,
                'net_revised': 1910183000,
                'title': 'משרד החקלאות'
            },
            {
                'code': '0034',
                'net_allocated': 619189000,
                'net_revised': 619189000,
                'title': 'משרד האנרגיה'
            },
            {
                'code': '0035',
                'net_allocated': 147927000,
                'net_revised': 147927000,
                'title': 'הועדה לאנרגיה אטומית'
            },
            {
                'code': '0036',
                'net_allocated': 3562689000,
                'net_revised': 3562689000,
                'title': 'תעסוקה'
            },
            {
                'code': '0037',
                'net_allocated': 351833000,
                'net_revised': 351833000,
                'title': 'משרד התיירות'
            },
            {
                'code': '0038',
                'net_allocated': 2760286000,
                'net_revised': 2760286000,
                'title': 'תמיכות בענפי המשק'
            },
            {
                'code': '0039',
                'net_allocated': 77647000,
                'net_revised': 77647000,
                'title': 'משרד התקשורת'
            },
            {
                'code': '0040',
                'net_allocated': 477717000,
                'net_revised': 477717000,
                'title': 'משרד התחבורה והבטיחות'
            },
            {
                'code': '0041',
                'net_allocated': 124127000,
                'net_revised': 124127000,
                'title': 'רשות ממשלתית למים'
            },
            {
                'code': '0042',
                'net_allocated': 2597874000,
                'net_revised': 2597874000,
                'title': 'מענקי בינוי ושיכון'
            },
            {
                'code': '0043',
                'net_allocated': 99322000,
                'net_revised': 99322000,
                'title': 'המרכז למיפוי ישראל'
            },
            {
                'code': '0045',
                'net_allocated': 39126000000,
                'net_revised': 39126000000,
                'title': 'תשלום ריבית ועמלות'
            },
            {
                'code': '0046',
                'net_allocated': 2361710000,
                'net_revised': 2361710000,
                'title': 'חוק חיילים משוחררים'
            },
            {
                'code': '0047',
                'net_allocated': 0,
                'net_revised': 0,
                'title': 'רזרבה כללית'
            },
            {
                'code': '0051',
                'net_allocated': 637512000,
                'net_revised': 637512000,
                'title': 'דיור ממשלתי'
            },
            {
                'code': '0052',
                'net_allocated': 533575000,
                'net_revised': 533575000,
                'title': 'פיתוח המשרד לביטחון-'
            },
            {
                'code': '0053',
                'net_allocated': 97305000,
                'net_revised': 97305000,
                'title': 'משפטים ובתי משפט'
            },
            {
                'code': '0054',
                'net_allocated': 921970000,
                'net_revised': 921970000,
                'title': 'רשויות פיקוח'
            },
            {
                'code': '0060',
                'net_allocated': 1361689000,
                'net_revised': 1361689000,
                'title': 'חינוך'
            },
            {
                'code': '0067',
                'net_allocated': 683141000,
                'net_revised': 683141000,
                'title': 'משרד הבריאות'
            },
            {
                'code': '0068',
                'net_allocated': 809952000,
                'net_revised': 809952000,
                'title': 'רשות האוכלוסין, ההגירה'
            },
            {
                'code': '0070',
                'net_allocated': 2023299000,
                'net_revised': 2023299000,
                'title': 'שיכון'
            },
            {
                'code': '0073',
                'net_allocated': 884058000,
                'net_revised': 884058000,
                'title': 'מפעלי מים'
            },
            {
                'code': '0076',
                'net_allocated': 167184000,
                'net_revised': 167184000,
                'title': 'תעשיה'
            },
            {
                'code': '0078',
                'net_allocated': 297351000,
                'net_revised': 297351000,
                'title': 'פיתוח תיירות'
            },
            {
                'code': '0079',
                'net_allocated': 20269338000,
                'net_revised': 20269338000,
                'title': 'פיתוח התחבורה'
            },
            {
                'code': '0083',
                'net_allocated': 3349998000,
                'net_revised': 3349998000,
                'title': 'הוצאות פיתוח אחרות'
            },
            {
                'code': '0084',
                'net_allocated': 95349500000,
                'net_revised': 95349500000,
                'title': 'תשלום חובות'
            },
            {
                'code': '0089',
                'net_allocated': 1366234000,
                'net_revised': 1366234000,
                'title': 'מפעלי משרד ראש הממשלה'
            },
            {
                'code': '0091',
                'net_allocated': 0,
                'net_revised': 0,
                'title': 'פיתוח לאומי'
            },
            {
                'code': '0093',
                'net_allocated': 2534768000,
                'net_revised': 2534768000,
                'title': 'בתי חולים לבריאות הנפש'
            },
            {
                'code': '0094',
                'net_allocated': 22281004000,
                'net_revised': 22281004000,
                'title': 'בתי חולים ממשלתים'
            },
            {
                'code': '0095',
                'net_allocated': 83988000,
                'net_revised': 83988000,
                'title': 'נמל חדרה'
            },
            {
                'code': '0098',
                'net_allocated': 20783364000,
                'net_revised': 20783364000,
                'title': 'הוצאות מינהל מקרקעי'
            }
        ],
        'income': 356720000000,
        'returns': 85468500000,
        'deficitFunding': 122884627000,
        'incomeChildren': [
            {
                'net_allocated': 171915000000,
                'title': 'מסים ישירים'
            },
            {
                'net_allocated': 146170652000,
                'title': 'מסים עקיפים'
            },
            {
                'net_allocated': 31984348000,
                'title': 'הכנסות אחרות'
            },
            {
                'net_allocated': 6650000000,
                'title': 'אגרות'
            }
        ]
    },
    'educationCharts': [
        {
            '__created_at': null,
            '__date_range_from': '2019-01-01',
            '__date_range_months': [
                '2019-01',
                '2019-02',
                '2019-03',
                '2019-04',
                '2019-05',
                '2019-06',
                '2019-07',
                '2019-08',
                '2019-09',
                '2019-10',
                '2019-11',
                '2019-12'
            ],
            '__date_range_to': '2019-12-31',
            '__hash': '2732bc262a075902a53caeff5191ee7c',
            '__is_new': false,
            '__is_stale': false,
            '__last_modified_at': '2018-12-03T15:37:43Z',
            '__last_updated_at': '2018-12-03T15:37:43Z',
            '__next_update_days': 1,
            '__revision': 21,
            '__staleness': 150000,
            'admin_cls_code_0': [
                '1'
            ],
            'amounts_allocated': 12412963,
            'amounts_executed': null,
            'amounts_revised': 12412963,
            'charts': [
                {
                    'chart': {
                        'centerHeight': 75,
                        'centerTitle': 'משרד החינוך',
                        'centerWidth': 200,
                        'directionLeft': true,
                        'groups': [
                            {
                                'class': 'budget-expense',
                                'flows': [
                                    {
                                        'context': 'budget/002050/2019',
                                        'label': '‹ טלויזיה חינוכית',
                                        'size': 297000
                                    },
                                    {
                                        'context': 'budget/002049/2019',
                                        'label': '‹ תמיכות בנושאי יהדות',
                                        'size': 1490675000
                                    },
                                    {
                                        'context': 'budget/002040/2019',
                                        'label': '‹ מטה המשרד',
                                        'size': 1730668000
                                    },
                                    {
                                        'context': 'budget/002051/2019',
                                        'label': '‹ רזרבות',
                                        'size': 1963487000
                                    },
                                    {
                                        'context': 'budget/002047/2019',
                                        'label': '‹ מינהל עובדי הוראה',
                                        'size': 1988180000
                                    },
                                    {
                                        'context': 'budget/002048/2019',
                                        'label': '‹ שירותי עזר והסעות',
                                        'size': 3663573000
                                    },
                                    {
                                        'context': 'budget/002045/2019',
                                        'label': '‹ חינוך התיישבותי',
                                        'size': 3673020000
                                    },
                                    {
                                        'context': 'budget/002046/2019',
                                        'label': '‹ תכניות חינוכיות משלימות',
                                        'size': 4890305000
                                    },
                                    {
                                        'context': 'budget/002042/2019',
                                        'label': '‹ קדם-יסודי',
                                        'size': 7194180000
                                    },
                                    {
                                        'context': 'budget/002041/2019',
                                        'label': '‹ חינוך מיוחד',
                                        'size': 7889882000
                                    },
                                    {
                                        'context': 'budget/002044/2019',
                                        'label': '‹ חטיבה עליונה',
                                        'size': 10100791000
                                    },
                                    {
                                        'context': 'budget/002043/2019',
                                        'label': '‹ יסודי וחטיבות-ביניים',
                                        'size': 15871614000
                                    }
                                ],
                                'labelTextSize': 14,
                                'leftSide': true,
                                'offset': 100,
                                'roundness': 50,
                                'slope': 1.2,
                                'width': 1
                            }
                        ],
                        'height': '760px',
                        'type': 'mushonkey',
                        'width': '100%'
                    },
                    'description': null,
                    'long_title': 'מהם תתי הסעיפים של סעיף זה?',
                    'title': 'מבנה התקציב',
                    'type': 'mushonkey'
                },
                {
                    'long_title': 'איך התקציב בסעיף זה השתנה לאורך השנים?',
                    'subcharts': [
                        {
                            'chart': [
                                {
                                    'mode': 'lines+markers',
                                    'name': 'תקציב מקורי',
                                    'x': [
                                        1997,
                                        1998,
                                        1999,
                                        2000,
                                        2001,
                                        2002,
                                        2003,
                                        2004,
                                        2005,
                                        2006,
                                        2007,
                                        2008,
                                        2009,
                                        2010,
                                        2011,
                                        2012,
                                        2013,
                                        2014,
                                        2015,
                                        2016,
                                        2017,
                                        2018,
                                        2019
                                    ],
                                    'y': [
                                        17998587000,
                                        19588376000,
                                        20085909000,
                                        20983486000,
                                        22339703000,
                                        23870824000,
                                        24627762000,
                                        24685348000,
                                        24531094000,
                                        25653928000,
                                        25877676000,
                                        27551845000,
                                        30311997000,
                                        32418924000,
                                        34901335000,
                                        36278439000,
                                        42425121000,
                                        43595011000,
                                        48859772000,
                                        50861316000,
                                        53805091000,
                                        56174410000,
                                        60456672000
                                    ]
                                },
                                {
                                    'mode': 'lines+markers',
                                    'name': 'אחרי שינויים',
                                    'x': [
                                        1997,
                                        1998,
                                        1999,
                                        2000,
                                        2001,
                                        2002,
                                        2003,
                                        2004,
                                        2005,
                                        2006,
                                        2007,
                                        2008,
                                        2009,
                                        2010,
                                        2011,
                                        2012,
                                        2013,
                                        2014,
                                        2015,
                                        2016,
                                        2017,
                                        2018,
                                        2019
                                    ],
                                    'y': [
                                        18079238000,
                                        19835506000,
                                        20643414000,
                                        21293620000,
                                        23535607000,
                                        24294205000,
                                        24921004000,
                                        25537640000,
                                        25506872000,
                                        26085676000,
                                        28881929000,
                                        29609863000,
                                        31267196000,
                                        34651668000,
                                        37534630000,
                                        40703672000,
                                        44624799000,
                                        46736612000,
                                        50554428000,
                                        53547520000,
                                        58390972000,
                                        60264215000,
                                        60456672000
                                    ]
                                },
                                {
                                    'mode': 'lines+markers',
                                    'name': 'ביצוע בפועל',
                                    'x': [
                                        1997,
                                        1998,
                                        1999,
                                        2000,
                                        2001,
                                        2002,
                                        2003,
                                        2004,
                                        2005,
                                        2006,
                                        2007,
                                        2008,
                                        2009,
                                        2010,
                                        2011,
                                        2012,
                                        2013,
                                        2014,
                                        2015,
                                        2016,
                                        2017,
                                        2018,
                                        2019
                                    ],
                                    'y': [
                                        17176380244,
                                        18516602605,
                                        20236285667,
                                        20908315183,
                                        23167327423,
                                        23289189728,
                                        23638772131,
                                        24685907411,
                                        24483145749,
                                        25098523160,
                                        27106375236,
                                        28621630029,
                                        30040732590,
                                        33207557192,
                                        35784375204,
                                        39338053598,
                                        42448260452,
                                        44709492453,
                                        47866175202,
                                        50709517534,
                                        55401746028,
                                        null,
                                        null
                                    ]
                                }
                            ],
                            'layout': {
                                'xaxis': {
                                    'title': 'שנה',
                                    'type': 'category'
                                },
                                'yaxis': {
                                    'rangemode': 'tozero',
                                    'separatethousands': true,
                                    'title': 'תקציב ב-₪'
                                }
                            },
                            'long_title': 'ערכי התקציב לאורך השנים (כפי שהופיעו בספרי התקציב)',
                            'title': 'נומינלית',
                            'type': 'plotly'
                        }
                    ],
                    'title': 'שינויי תקציב'
                },
                {
                    'chart': {
                        'centerHeight': 75,
                        'centerTitle': 'משרד החינוך',
                        'centerWidth': 200,
                        'directionLeft': true,
                        'groups': [
                            {
                                'class': 'budget-expense',
                                'flows': [
                                    {
                                        'context': null,
                                        'label': 'העברות פנים תקציביות',
                                        'size': 22805000
                                    },
                                    {
                                        'context': null,
                                        'label': 'קניות ורכש',
                                        'size': 1695392000
                                    },
                                    {
                                        'context': null,
                                        'label': 'שכר',
                                        'size': 23827200000
                                    },
                                    {
                                        'context': null,
                                        'label': 'העברות ותמיכות',
                                        'size': 34911275000
                                    }
                                ],
                                'labelTextSize': 14,
                                'leftSide': true,
                                'offset': 100,
                                'roundness': 50,
                                'slope': 1.2,
                                'width': 1
                            }
                        ],
                        'height': '520px',
                        'type': 'mushonkey',
                        'width': '100%'
                    },
                    'long_title': 'באילו דרכים ושיטות מוציאים את הכסף בסעיף זה?',
                    'title': 'דרכי שימוש',
                    'type': 'mushonkey'
                }
            ],
            'children': [
                {
                    'code': '002040',
                    'net_allocated': 1730668000,
                    'net_revised': 1730668000,
                    'title': 'מטה המשרד'
                },
                {
                    'code': '002041',
                    'net_allocated': 7889882000,
                    'net_revised': 7889882000,
                    'title': 'חינוך מיוחד'
                },
                {
                    'code': '002042',
                    'net_allocated': 7194180000,
                    'net_revised': 7194180000,
                    'title': 'קדם-יסודי'
                },
                {
                    'code': '002043',
                    'net_allocated': 15871614000,
                    'net_revised': 15871614000,
                    'title': 'יסודי וחטיבות-ביניים'
                },
                {
                    'code': '002044',
                    'net_allocated': 10100791000,
                    'net_revised': 10100791000,
                    'title': 'חטיבה עליונה'
                },
                {
                    'code': '002045',
                    'net_allocated': 3673020000,
                    'net_revised': 3673020000,
                    'title': 'חינוך התיישבותי'
                },
                {
                    'code': '002046',
                    'net_allocated': 4890305000,
                    'net_revised': 4890305000,
                    'title': 'תכניות חינוכיות משלימות'
                },
                {
                    'code': '002047',
                    'net_allocated': 1988180000,
                    'net_revised': 1988180000,
                    'title': 'מינהל עובדי הוראה'
                },
                {
                    'code': '002048',
                    'net_allocated': 3663573000,
                    'net_revised': 3663573000,
                    'title': 'שירותי עזר והסעות'
                },
                {
                    'code': '002049',
                    'net_allocated': 1490675000,
                    'net_revised': 1490675000,
                    'title': 'תמיכות בנושאי יהדות'
                },
                {
                    'code': '002050',
                    'net_allocated': 297000,
                    'net_revised': 297000,
                    'title': 'טלויזיה חינוכית'
                },
                {
                    'code': '002051',
                    'net_allocated': 1963487000,
                    'net_revised': 1963487000,
                    'title': 'רזרבות'
                },
                {
                    'code': '002099',
                    'net_allocated': 0,
                    'net_revised': 0,
                    'title': 'חשבון מעבר'
                }
            ],
            'code': '0020',
            'commitment_allowance_allocated': 1747000000,
            'commitment_allowance_executed': null,
            'commitment_allowance_revised': 1747000000,
            'commitment_balance_allocated': null,
            'commitment_balance_executed': null,
            'commitment_balance_revised': null,
            'contractors_allocated': 518,
            'contractors_executed': null,
            'contractors_revised': 518,
            'dedicated_allocated': -2721905000,
            'dedicated_executed': null,
            'dedicated_revised': -2721905000,
            'depth': 1,
            'direction': [
                'הכנסה',
                'הוצאה'
            ],
            'doc_id': 'budget/0020/2019',
            'econ_cls_title_1': [
                'שכר',
                'הכנסות מיועדות',
                'חשבונות מעבר',
                'קניות',
                'העברות',
                'העברות  פנים תקציביות'
            ],
            'econ_cls_title_2': [
                'קניות בחו"ל',
                'השתתפויות',
                'תמיכות לפי סעיף 3א',
                'חשבונות מעבר',
                'הפחתות',
                'שכר בארץ',
                'שכר עקיף',
                'מוצרים ציבוריים',
                'הכנסות תקציב רגיל',
                'תשלומי העברה סוציאליים',
                'רזרבה',
                'קניות בארץ'
            ],
            'explanation': null,
            'explanation_short': null,
            'explanation_source': null,
            'func_cls_title_1': [
                'שירותים חברתיים'
            ],
            'func_cls_title_2': [
                'חינוך'
            ],
            'gross_allocated': 2721905000,
            'gross_executed': null,
            'gross_revised': 2721905000,
            'hierarchy': [
                [
                    '00',
                    'המדינה'
                ]
            ],
            'history': {
                '1997': {
                    'amounts_allocated': 2099616,
                    'amounts_executed': 40868,
                    'amounts_revised': 2099616,
                    'code_titles': [
                        '0020:משרד החינוך והתרבות'
                    ],
                    'commitment_allowance_allocated': 501468000,
                    'commitment_allowance_executed': 1616518496,
                    'commitment_allowance_revised': 501468000,
                    'commitment_balance_executed': 393617724,
                    'contractors_allocated': 7235,
                    'contractors_executed': 0,
                    'contractors_revised': 7235,
                    'dedicated_allocated': -420916000,
                    'dedicated_revised': -512709000,
                    'depth': 1,
                    'gross_allocated': 420916000,
                    'gross_revised': 512709000,
                    'net_allocated': 17998587000,
                    'net_executed': 17176380244,
                    'net_revised': 18079238000,
                    'personnel_allocated': 2088.5,
                    'personnel_executed': 23715,
                    'personnel_revised': 2088,
                    'total_direction_expense': 18680632000,
                    'total_direction_income': -601394000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_interim_accounts': 0,
                    'total_econ_cls_internal_transfers': 312245000,
                    'total_econ_cls_procurement': 549884000,
                    'total_econ_cls_salaries': 7298886000,
                    'total_econ_cls_transfers': 9918223000
                },
                '1998': {
                    'amounts_allocated': 2558030,
                    'amounts_executed': 65047,
                    'amounts_revised': 2711030,
                    'code_titles': [
                        '0020:משרד החינוך והתרבות'
                    ],
                    'commitment_allowance_allocated': 493893000,
                    'commitment_allowance_executed': 788356632,
                    'commitment_allowance_revised': 493893000,
                    'commitment_balance_executed': 274307422,
                    'contractors_allocated': 7485,
                    'contractors_executed': 2097,
                    'contractors_revised': 8176,
                    'dedicated_allocated': -472182000,
                    'dedicated_revised': -574541000,
                    'depth': 1,
                    'gross_allocated': 472182000,
                    'gross_revised': 574541000,
                    'net_allocated': 19588376000,
                    'net_executed': 18516602605,
                    'net_revised': 19835506000,
                    'personnel_allocated': 2062,
                    'personnel_executed': 24386,
                    'personnel_revised': 2061.5,
                    'total_direction_expense': 20412529000,
                    'total_direction_income': -577023000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_interim_accounts': 0,
                    'total_econ_cls_internal_transfers': 346661000,
                    'total_econ_cls_procurement': 566763000,
                    'total_econ_cls_reserve': 394372000,
                    'total_econ_cls_salaries': 7942682000,
                    'total_econ_cls_transfers': 10585028000
                },
                '1999': {
                    'amounts_allocated': 2758329,
                    'amounts_executed': 1096250,
                    'amounts_revised': 2889646,
                    'code_titles': [
                        '0020:משרד החינוך והתרבות'
                    ],
                    'commitment_allowance_allocated': 499534000,
                    'commitment_allowance_executed': 796673799,
                    'commitment_allowance_revised': 623384000,
                    'commitment_balance_executed': 382721049,
                    'contractors_allocated': 5562,
                    'contractors_executed': 10182,
                    'contractors_revised': 5994,
                    'dedicated_allocated': -479267000,
                    'dedicated_revised': -1041832000,
                    'depth': 1,
                    'gross_allocated': 479267000,
                    'gross_revised': 1041832000,
                    'net_allocated': 20085909000,
                    'net_executed': 20236285667,
                    'net_revised': 20643414000,
                    'personnel_allocated': 1964.5,
                    'personnel_executed': 1962,
                    'personnel_revised': 1965.5,
                    'total_direction_expense': 20791054000,
                    'total_direction_income': -147640000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_interim_accounts': 0,
                    'total_econ_cls_internal_transfers': 62732000,
                    'total_econ_cls_procurement': 677869000,
                    'total_econ_cls_reserve': 0,
                    'total_econ_cls_salaries': 8235204000,
                    'total_econ_cls_transfers': 11667609000
                },
                '2000': {
                    'amounts_allocated': 4064416,
                    'amounts_executed': 1048680,
                    'amounts_revised': 4069986,
                    'code_titles': [
                        '0020:משרד החינוך והתרבות'
                    ],
                    'commitment_allowance_allocated': 1294248000,
                    'commitment_allowance_executed': 1674121118,
                    'commitment_allowance_revised': 1345248000,
                    'commitment_balance_executed': 651279877,
                    'contractors_allocated': 5294,
                    'contractors_executed': 6696,
                    'contractors_revised': 5436,
                    'dedicated_allocated': -1000805000,
                    'dedicated_revised': -1080127000,
                    'depth': 1,
                    'gross_allocated': 1000805000,
                    'gross_revised': 1080127000,
                    'net_allocated': 20983486000,
                    'net_executed': 20908315183,
                    'net_revised': 21293620000,
                    'personnel_allocated': 1896.5,
                    'personnel_executed': 1884.5,
                    'personnel_revised': 1903.5,
                    'total_direction_expense': 21414796000,
                    'total_direction_income': -121176000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_interim_accounts': 0,
                    'total_econ_cls_internal_transfers': 59945000,
                    'total_econ_cls_procurement': 893491000,
                    'total_econ_cls_reserve': 0,
                    'total_econ_cls_salaries': 8809198000,
                    'total_econ_cls_transfers': 11530986000
                },
                '2001': {
                    'amounts_allocated': 4160730,
                    'amounts_executed': 996390,
                    'amounts_revised': 4204775,
                    'code_titles': [
                        '0020:משרד החינוך והתרבות'
                    ],
                    'commitment_allowance_allocated': 1326604000,
                    'commitment_allowance_executed': 1202348293,
                    'commitment_allowance_revised': 1326604000,
                    'commitment_balance_executed': 448920061,
                    'contractors_allocated': 4775,
                    'contractors_executed': 6170,
                    'contractors_revised': 5065,
                    'dedicated_allocated': -1008923000,
                    'dedicated_revised': -1267220000,
                    'depth': 1,
                    'gross_allocated': 1008923000,
                    'gross_revised': 1267220000,
                    'net_allocated': 22339703000,
                    'net_executed': 23167327423,
                    'net_revised': 23535607000,
                    'personnel_allocated': 1865,
                    'personnel_executed': 1877.5,
                    'personnel_revised': 1865,
                    'total_direction_expense': 23689115000,
                    'total_direction_income': -153508000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_interim_accounts': 0,
                    'total_econ_cls_internal_transfers': 46351000,
                    'total_econ_cls_procurement': 996629000,
                    'total_econ_cls_reserve': 0,
                    'total_econ_cls_salaries': 9492421000,
                    'total_econ_cls_transfers': 13000206000
                },
                '2002': {
                    'amounts_allocated': 4910994,
                    'amounts_executed': 946144,
                    'amounts_revised': 4233336,
                    'code_titles': [
                        '0020:משרד החינוך והתרבות'
                    ],
                    'commitment_allowance_allocated': 2056963000,
                    'commitment_allowance_executed': 1541135755,
                    'commitment_allowance_revised': 2056963000,
                    'commitment_balance_executed': 638733328,
                    'contractors_allocated': 4985,
                    'contractors_executed': 6062.5,
                    'contractors_revised': 5024,
                    'dedicated_allocated': -1113670000,
                    'dedicated_revised': -1348972000,
                    'depth': 1,
                    'gross_allocated': 1113670000,
                    'gross_revised': 1348972000,
                    'net_allocated': 23870824000,
                    'net_executed': 23289189728,
                    'net_revised': 24294205000,
                    'personnel_allocated': 1827,
                    'personnel_executed': 1801.5,
                    'personnel_revised': 1835.5,
                    'total_direction_expense': 24430854000,
                    'total_direction_income': -136649000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_interim_accounts': 0,
                    'total_econ_cls_internal_transfers': 81576000,
                    'total_econ_cls_procurement': 970733000,
                    'total_econ_cls_reserve': 0,
                    'total_econ_cls_salaries': 10109644000,
                    'total_econ_cls_transfers': 13132252000
                },
                '2003': {
                    'amounts_allocated': 4021426,
                    'amounts_executed': 919374,
                    'amounts_revised': 4210501,
                    'code_titles': [
                        '0020:משרד החינוך התרבות'
                    ],
                    'commitment_allowance_allocated': 2023849000,
                    'commitment_allowance_executed': 737777179,
                    'commitment_allowance_revised': 2023849000,
                    'commitment_balance_executed': 313206624,
                    'contractors_allocated': 4934,
                    'contractors_executed': 6061.5,
                    'contractors_revised': 5030,
                    'dedicated_allocated': -1184719000,
                    'dedicated_revised': -1437934000,
                    'depth': 1,
                    'gross_allocated': 1184719000,
                    'gross_revised': 1437934000,
                    'net_allocated': 24627762000,
                    'net_executed': 23638772131,
                    'net_revised': 24921004000,
                    'personnel_allocated': 1740.5,
                    'personnel_executed': 1739,
                    'personnel_revised': 1796,
                    'total_direction_expense': 25081051000,
                    'total_direction_income': -160047000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_interim_accounts': 0,
                    'total_econ_cls_internal_transfers': 31523000,
                    'total_econ_cls_procurement': 1008193000,
                    'total_econ_cls_reserve': 5146000,
                    'total_econ_cls_salaries': 9510849000,
                    'total_econ_cls_transfers': 14365293000
                },
                '2004': {
                    'amounts_allocated': 4654125,
                    'amounts_executed': 866896,
                    'amounts_revised': 4868008,
                    'code_titles': [
                        '0020:משרד החינוך התרבות'
                    ],
                    'commitment_allowance_allocated': 1463525000,
                    'commitment_allowance_executed': 84837459,
                    'commitment_allowance_revised': 1463525000,
                    'commitment_balance_executed': 423303527,
                    'contractors_allocated': 6945,
                    'contractors_executed': 8099.5,
                    'contractors_revised': 8113,
                    'dedicated_allocated': -1212967000,
                    'dedicated_revised': -1369720000,
                    'depth': 1,
                    'gross_allocated': 1212967000,
                    'gross_revised': 1369720000,
                    'net_allocated': 24685348000,
                    'net_executed': 24685907411,
                    'net_revised': 25537640000,
                    'personnel_allocated': 1672,
                    'personnel_executed': 1663,
                    'personnel_revised': 1749,
                    'total_direction_expense': 25745138000,
                    'total_direction_income': -207498000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_interim_accounts': 0,
                    'total_econ_cls_internal_transfers': 237076000,
                    'total_econ_cls_procurement': 936301000,
                    'total_econ_cls_reserve': 0,
                    'total_econ_cls_salaries': 9921142000,
                    'total_econ_cls_transfers': 14443121000
                },
                '2005': {
                    'amounts_allocated': 7159435,
                    'amounts_executed': 980030,
                    'amounts_revised': 7255189,
                    'code_titles': [
                        '0020:משרד החינוך התרבות'
                    ],
                    'commitment_allowance_allocated': 1550811000,
                    'commitment_allowance_executed': 58577779,
                    'commitment_allowance_revised': 1505837000,
                    'commitment_balance_executed': 721295736,
                    'contractors_allocated': 7618,
                    'contractors_executed': 9289.5,
                    'contractors_revised': 8588,
                    'dedicated_allocated': -1332228000,
                    'dedicated_revised': -1563663000,
                    'depth': 1,
                    'gross_allocated': 1332228000,
                    'gross_revised': 1563663000,
                    'net_allocated': 24531094000,
                    'net_executed': 24483145749,
                    'net_revised': 25506872000,
                    'personnel_allocated': 1678,
                    'personnel_executed': 1642,
                    'personnel_revised': 1677,
                    'total_direction_expense': 26222801000,
                    'total_direction_income': -715929000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_interim_accounts': 0,
                    'total_econ_cls_internal_transfers': -413902000,
                    'total_econ_cls_procurement': 1043478000,
                    'total_econ_cls_reserve': 0,
                    'total_econ_cls_salaries': 9352803000,
                    'total_econ_cls_transfers': 15524493000
                },
                '2006': {
                    'amounts_allocated': 7474809,
                    'amounts_executed': 936686,
                    'amounts_revised': 7225193,
                    'code_titles': [
                        '0020:משרד החינוך התרבות'
                    ],
                    'commitment_allowance_allocated': 1465566000,
                    'commitment_allowance_executed': 94865806,
                    'commitment_allowance_revised': 1465566000,
                    'commitment_balance_executed': 764424989,
                    'contractors_allocated': 8857,
                    'contractors_executed': 9509,
                    'contractors_revised': 9048,
                    'dedicated_allocated': -1476280000,
                    'dedicated_revised': -1553065000,
                    'depth': 1,
                    'gross_allocated': 1476280000,
                    'gross_revised': 1553065000,
                    'net_allocated': 25653928000,
                    'net_executed': 25098523160,
                    'net_revised': 26085676000,
                    'personnel_allocated': 1664,
                    'personnel_executed': 1616,
                    'personnel_revised': 1627,
                    'total_direction_expense': 26421650000,
                    'total_direction_income': -335974000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_interim_accounts': 0,
                    'total_econ_cls_internal_transfers': -45637000,
                    'total_econ_cls_procurement': 1083061000,
                    'total_econ_cls_salaries': 10132440000,
                    'total_econ_cls_transfers': 14915812000
                },
                '2007': {
                    'amounts_allocated': 6726877,
                    'amounts_executed': 941029,
                    'amounts_revised': 6936392,
                    'code_titles': [
                        '0020:משרד החינוך'
                    ],
                    'commitment_allowance_allocated': 1465566000,
                    'commitment_allowance_executed': 131500845,
                    'commitment_allowance_revised': 1465566000,
                    'commitment_balance_executed': 2158162283,
                    'contractors_allocated': 8724,
                    'contractors_executed': 9629.5,
                    'contractors_revised': 9012,
                    'dedicated_allocated': -1517908000,
                    'dedicated_revised': -1558930000,
                    'depth': 1,
                    'gross_allocated': 1517908000,
                    'gross_revised': 1558930000,
                    'net_allocated': 25877676000,
                    'net_executed': 27106375236,
                    'net_revised': 28881929000,
                    'personnel_allocated': 1598,
                    'personnel_executed': 1578,
                    'personnel_revised': 1610,
                    'total_direction_expense': 29497885000,
                    'total_direction_income': -615956000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_interim_accounts': 0,
                    'total_econ_cls_internal_transfers': -249759000,
                    'total_econ_cls_procurement': 1243828000,
                    'total_econ_cls_reserve': 0,
                    'total_econ_cls_salaries': 11588684000,
                    'total_econ_cls_transfers': 16299176000
                },
                '2008': {
                    'amounts_allocated': 6950611,
                    'amounts_executed': 926891,
                    'amounts_revised': 7064889,
                    'code_titles': [
                        '0020:משרד החינוך'
                    ],
                    'commitment_allowance_allocated': 1465566000,
                    'commitment_allowance_executed': 144120500,
                    'commitment_allowance_revised': 1146598000,
                    'commitment_balance_executed': 953927226,
                    'contractors_allocated': 9165,
                    'contractors_executed': 9761,
                    'contractors_revised': 9299,
                    'dedicated_allocated': -1512418000,
                    'dedicated_revised': -1578632000,
                    'depth': 1,
                    'gross_allocated': 1512418000,
                    'gross_revised': 1578632000,
                    'net_allocated': 27551845000,
                    'net_executed': 28621630029,
                    'net_revised': 29609863000,
                    'personnel_allocated': 1543,
                    'personnel_executed': 1520,
                    'personnel_revised': 1535,
                    'total_direction_expense': 30426008000,
                    'total_direction_income': -816145000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_interim_accounts': 0,
                    'total_econ_cls_internal_transfers': -457531000,
                    'total_econ_cls_procurement': 1244286000,
                    'total_econ_cls_salaries': 12054640000,
                    'total_econ_cls_transfers': 16768468000
                },
                '2009': {
                    'amounts_allocated': 7007178,
                    'amounts_executed': 925442,
                    'amounts_revised': 7145852,
                    'code_titles': [
                        '0020:משרד החינוך'
                    ],
                    'commitment_allowance_allocated': 1465566000,
                    'commitment_allowance_executed': 56374702,
                    'commitment_allowance_revised': 1460566000,
                    'commitment_balance_executed': 1220904920,
                    'contractors_allocated': 3665,
                    'contractors_executed': 6214.5,
                    'contractors_revised': 3044,
                    'dedicated_allocated': -1550552000,
                    'dedicated_revised': -1586097000,
                    'depth': 1,
                    'gross_allocated': 1550552000,
                    'gross_revised': 1586097000,
                    'net_allocated': 30311997000,
                    'net_executed': 30040732590,
                    'net_revised': 31267196000,
                    'personnel_allocated': 1961,
                    'personnel_executed': 1896.5,
                    'personnel_revised': 2036,
                    'total_direction_expense': 31616973000,
                    'total_direction_income': -349777000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_interim_accounts': 0,
                    'total_econ_cls_internal_transfers': -40205000,
                    'total_econ_cls_procurement': 1307474000,
                    'total_econ_cls_salaries': 12747460000,
                    'total_econ_cls_transfers': 17252467000
                },
                '2010': {
                    'amounts_allocated': 7643198,
                    'amounts_executed': 1001265,
                    'amounts_revised': 7901900,
                    'code_titles': [
                        '0020:משרד החינוך'
                    ],
                    'commitment_allowance_allocated': 268828000,
                    'commitment_allowance_executed': 148032669,
                    'commitment_allowance_revised': 350878000,
                    'commitment_balance_executed': 1418719658,
                    'contractors_allocated': 3380,
                    'contractors_executed': 4264,
                    'contractors_revised': 4808,
                    'dedicated_allocated': -1564058000,
                    'dedicated_revised': -1621104000,
                    'depth': 1,
                    'gross_allocated': 1564058000,
                    'gross_revised': 1621104000,
                    'net_allocated': 32418924000,
                    'net_executed': 33207557192,
                    'net_revised': 34651668000,
                    'personnel_allocated': 1957,
                    'personnel_executed': 1941,
                    'personnel_revised': 1967,
                    'total_direction_expense': 35046579000,
                    'total_direction_income': -394911000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_interim_accounts': 0,
                    'total_econ_cls_internal_transfers': -33274000,
                    'total_econ_cls_procurement': 1465822000,
                    'total_econ_cls_salaries': 14125340000,
                    'total_econ_cls_transfers': 19093780000
                },
                '2011': {
                    'amounts_allocated': 8889020,
                    'amounts_executed': 1093172,
                    'amounts_revised': 8948104,
                    'code_titles': [
                        '0020:משרד החינוך'
                    ],
                    'commitment_allowance_allocated': 171500000,
                    'commitment_allowance_executed': 248339794,
                    'commitment_allowance_revised': 546179000,
                    'commitment_balance_executed': 1838417545,
                    'contractors_allocated': 3182,
                    'contractors_executed': 4363,
                    'contractors_revised': 1913,
                    'dedicated_allocated': -1595386000,
                    'dedicated_revised': -1681812000,
                    'depth': 1,
                    'gross_allocated': 1595386000,
                    'gross_revised': 1681812000,
                    'net_allocated': 34901335000,
                    'net_executed': 35784375204,
                    'net_revised': 37534630000,
                    'personnel_allocated': 2092,
                    'personnel_executed': 2040.5,
                    'personnel_revised': 2209,
                    'total_direction_expense': 37924158000,
                    'total_direction_income': -389528000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_interim_accounts': 0,
                    'total_econ_cls_internal_transfers': -25929000,
                    'total_econ_cls_procurement': 1650296000,
                    'total_econ_cls_salaries': 15514540000,
                    'total_econ_cls_transfers': 20395723000
                },
                '2012': {
                    'amounts_allocated': 9105389,
                    'amounts_executed': 1220396,
                    'amounts_revised': 9322576,
                    'code_titles': [
                        '0020:משרד החינוך'
                    ],
                    'commitment_allowance_allocated': 157000000,
                    'commitment_allowance_executed': 563586548,
                    'commitment_allowance_revised': 680484000,
                    'commitment_balance_executed': 1870450755,
                    'contractors_allocated': 3160,
                    'contractors_executed': 3184,
                    'contractors_revised': 3242,
                    'dedicated_allocated': -1595076000,
                    'dedicated_revised': -1998132000,
                    'depth': 1,
                    'gross_allocated': 1595076000,
                    'gross_revised': 1998132000,
                    'net_allocated': 36278439000,
                    'net_executed': 39338053598,
                    'net_revised': 40703672000,
                    'personnel_allocated': 2081,
                    'personnel_executed': 2127.5,
                    'personnel_revised': 2123.5,
                    'total_direction_expense': 41130998000,
                    'total_direction_income': -427326000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_interim_accounts': 0,
                    'total_econ_cls_internal_transfers': -18321000,
                    'total_econ_cls_procurement': 1865004000,
                    'total_econ_cls_salaries': 16999087000,
                    'total_econ_cls_transfers': 21857902000
                },
                '2013': {
                    'amounts_allocated': 10386485,
                    'amounts_executed': 1069730,
                    'amounts_revised': 10411516,
                    'code_titles': [
                        '0020:משרד החינוך'
                    ],
                    'commitment_allowance_allocated': 157000000,
                    'commitment_allowance_executed': 37730297,
                    'commitment_allowance_revised': 157000000,
                    'commitment_balance_executed': 2138580205,
                    'contractors_allocated': 1535,
                    'contractors_executed': 2771,
                    'contractors_revised': 1535,
                    'dedicated_allocated': -1678477000,
                    'dedicated_revised': -2101395000,
                    'depth': 1,
                    'gross_allocated': 1678477000,
                    'gross_revised': 2101395000,
                    'net_allocated': 42425121000,
                    'net_executed': 42448260452,
                    'net_revised': 44624799000,
                    'personnel_allocated': 2248,
                    'personnel_executed': 2150,
                    'personnel_revised': 2248,
                    'total_direction_expense': 45065558000,
                    'total_direction_income': -440759000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_interim_accounts': 0,
                    'total_econ_cls_internal_transfers': -13050000,
                    'total_econ_cls_procurement': 2638140000,
                    'total_econ_cls_salaries': 18337497000,
                    'total_econ_cls_transfers': 23662212000
                },
                '2014': {
                    'amounts_allocated': 10382187,
                    'amounts_executed': 1223252,
                    'amounts_revised': 10761788,
                    'code_titles': [
                        '0020:משרד החינוך'
                    ],
                    'commitment_allowance_allocated': 193000000,
                    'commitment_allowance_executed': 68002960,
                    'commitment_allowance_revised': 193000000,
                    'commitment_balance_executed': 1973032886,
                    'contractors_allocated': 1510,
                    'contractors_executed': 2592.5,
                    'contractors_revised': 1518,
                    'dedicated_allocated': -1681286000,
                    'dedicated_revised': -2250230000,
                    'depth': 1,
                    'gross_allocated': 1681286000,
                    'gross_revised': 2250230000,
                    'net_allocated': 43595011000,
                    'net_executed': 44709492453,
                    'net_revised': 46736612000,
                    'personnel_allocated': 2241,
                    'personnel_executed': 2156,
                    'personnel_revised': 2225.5,
                    'total_direction_expense': 47104437000,
                    'total_direction_income': -367825000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_interim_accounts': 0,
                    'total_econ_cls_internal_transfers': 40832000,
                    'total_econ_cls_procurement': 2893672000,
                    'total_econ_cls_salaries': 19596534000,
                    'total_econ_cls_transfers': 24205574000
                },
                '2015': {
                    'amounts_allocated': 10796522,
                    'amounts_executed': 1132545,
                    'amounts_revised': 11074077,
                    'code_titles': [
                        '0020:משרד החינוך'
                    ],
                    'commitment_allowance_allocated': 802484000,
                    'commitment_allowance_executed': 1547387809,
                    'commitment_allowance_revised': 1897520000,
                    'commitment_balance_executed': 3549397955,
                    'contractors_allocated': 1318,
                    'contractors_executed': 2417.5,
                    'contractors_revised': 1318,
                    'dedicated_allocated': -2302377000,
                    'dedicated_revised': -2386533000,
                    'depth': 1,
                    'gross_allocated': 2302377000,
                    'gross_revised': 2386533000,
                    'net_allocated': 48859772000,
                    'net_executed': 47866175202,
                    'net_revised': 50554428000,
                    'personnel_allocated': 2409,
                    'personnel_executed': 2173,
                    'personnel_revised': 2409,
                    'total_direction_expense': 50926265000,
                    'total_direction_income': -371837000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_interim_accounts': 0,
                    'total_econ_cls_internal_transfers': 8651000,
                    'total_econ_cls_procurement': 1869967000,
                    'total_econ_cls_salaries': 20255072000,
                    'total_econ_cls_transfers': 28420738000
                },
                '2016': {
                    'amounts_allocated': 11503436,
                    'amounts_executed': 1263020,
                    'amounts_revised': 11631444,
                    'code_titles': [
                        '0020:משרד החינוך'
                    ],
                    'commitment_allowance_allocated': 540807000,
                    'commitment_allowance_executed': 2157052983,
                    'commitment_allowance_revised': 2387595000,
                    'commitment_balance_executed': 4382103247,
                    'contractors_allocated': 1932,
                    'contractors_executed': 2654.5,
                    'contractors_revised': 1932,
                    'dedicated_allocated': -2302377000,
                    'dedicated_revised': -2343808000,
                    'depth': 1,
                    'gross_allocated': 2302377000,
                    'gross_revised': 2343808000,
                    'net_allocated': 50861316000,
                    'net_executed': 50709517534,
                    'net_revised': 53547520000,
                    'personnel_allocated': 2374,
                    'personnel_executed': 2212,
                    'personnel_revised': 2374,
                    'total_direction_expense': 53930871000,
                    'total_direction_income': -383351000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_interim_accounts': 0,
                    'total_econ_cls_internal_transfers': 23042000,
                    'total_econ_cls_procurement': 2148785000,
                    'total_econ_cls_salaries': 21053727000,
                    'total_econ_cls_transfers': 30321966000
                },
                '2017': {
                    'amounts_allocated': 11831222,
                    'amounts_executed': 1284992,
                    'amounts_revised': 11860873,
                    'code_titles': [
                        '0020:משרד החינוך'
                    ],
                    'commitment_allowance_allocated': 2147000000,
                    'commitment_allowance_executed': 1707694410,
                    'commitment_allowance_revised': 2147000000,
                    'commitment_balance_executed': 4354017787,
                    'contractors_allocated': 1592,
                    'contractors_executed': 2616,
                    'contractors_revised': 1664,
                    'dedicated_allocated': -2387698000,
                    'dedicated_revised': -2654176000,
                    'depth': 1,
                    'gross_allocated': 2387698000,
                    'gross_revised': 2654176000,
                    'net_allocated': 53805091000,
                    'net_executed': 55401746028,
                    'net_revised': 58390972000,
                    'personnel_allocated': 2381,
                    'personnel_executed': 2284,
                    'personnel_revised': 2390,
                    'total_direction_expense': 58794758000,
                    'total_direction_income': -403786000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_interim_accounts': 0,
                    'total_econ_cls_internal_transfers': 7511000,
                    'total_econ_cls_procurement': 2404468000,
                    'total_econ_cls_salaries': 22399332000,
                    'total_econ_cls_transfers': 33579661000
                },
                '2018': {
                    'amounts_allocated': 12148546,
                    'amounts_revised': 12148546,
                    'code_titles': [
                        '0020:משרד החינוך'
                    ],
                    'commitment_allowance_allocated': 2147000000,
                    'commitment_allowance_revised': 2147000000,
                    'contractors_allocated': 1612,
                    'contractors_revised': 1612,
                    'dedicated_allocated': -2387698000,
                    'dedicated_revised': -2789307000,
                    'depth': 1,
                    'gross_allocated': 2387698000,
                    'gross_revised': 2789307000,
                    'net_allocated': 56174410000,
                    'net_revised': 60264215000,
                    'personnel_allocated': 2376,
                    'personnel_revised': 2389,
                    'total_direction_expense': 60186268000,
                    'total_direction_income': 77947000,
                    'total_econ_cls_dedicated_income': 108642000,
                    'total_econ_cls_interim_accounts': 0,
                    'total_econ_cls_internal_transfers': 1728117000,
                    'total_econ_cls_procurement': 2551784000,
                    'total_econ_cls_salaries': 23528738000,
                    'total_econ_cls_transfers': 32346934000
                }
            },
            'net_allocated': 60456672000,
            'net_executed': null,
            'net_revised': 60456672000,
            'nice-breadcrumbs': '1997 - 2019',
            'nice-category': 'שירותים חברתיים / חינוך',
            'nice-code': '20',
            'nice-econ-category': 'העברות-תמיכות לפי סעיף 3א, קניות-קניות בחו"ל, העברות  פנים ת' +
'קציביות-הפחתות, חשבונות מעבר-חשבונות מעבר, העברות-שכר עקיף, ' +
'העברות-רזרבה, העברות-מוצרים ציבוריים, קניות-רזרבה, העברות  פ' +
'נים תקציביות-השתתפויות, העברות-תשלומי העברה סוציאליים, שכר-ש' +
'כר בארץ, שכר-רזרבה, הכנסות מיועדות-הכנסות תקציב רגיל, קניות-' +
'קניות בארץ',
            'non_repeating': [
                0,
                1
            ],
            'page_title': 'תקציב משרד החינוך (20)',
            'parent': '00',
            'personnel_allocated': 2308,
            'personnel_executed': null,
            'personnel_revised': 2308,
            'rev_last_modified_at': '2018-12-03',
            'rev_last_updated_at': '2018-12-03',
            'score': 60456672,
            'semantic_tags': [],
            'simple-code': '20',
            'title': 'משרד החינוך',
            'total_direction_expense': 60840702000,
            'total_direction_income': -384030000,
            'total_econ_cls_capital_expenditure': null,
            'total_econ_cls_credit': null,
            'total_econ_cls_debt_repayment_interest': null,
            'total_econ_cls_debt_repayment_principal': null,
            'total_econ_cls_dedicated_income': 0,
            'total_econ_cls_income': null,
            'total_econ_cls_income_bank_of_israel': null,
            'total_econ_cls_income_grants': null,
            'total_econ_cls_income_loans': null,
            'total_econ_cls_interim_accounts': 0,
            'total_econ_cls_internal_transfers': 22805000,
            'total_econ_cls_investment': null,
            'total_econ_cls_procurement': 1695392000,
            'total_econ_cls_reserve': null,
            'total_econ_cls_salaries': 23827200000,
            'total_econ_cls_transfers': 34911275000,
            'year': 2019
        },
        {
            '__created_at': null,
            '__date_range_from': '2019-01-01',
            '__date_range_months': [
                '2019-01',
                '2019-02',
                '2019-03',
                '2019-04',
                '2019-05',
                '2019-06',
                '2019-07',
                '2019-08',
                '2019-09',
                '2019-10',
                '2019-11',
                '2019-12'
            ],
            '__date_range_to': '2019-12-31',
            '__hash': 'e17c57bac8610b40c02794f9340ae030',
            '__is_new': false,
            '__is_stale': false,
            '__last_modified_at': '2018-12-03T15:37:43Z',
            '__last_updated_at': '2018-12-03T15:37:43Z',
            '__next_update_days': 1,
            '__revision': 21,
            '__staleness': 150000,
            'admin_cls_code_0': [
                '1'
            ],
            'amounts_allocated': 5545,
            'amounts_executed': null,
            'amounts_revised': 5545,
            'charts': [
                {
                    'chart': {
                        'centerHeight': 75,
                        'centerTitle': 'תכניות חינוכיות משלימות',
                        'centerWidth': 200,
                        'directionLeft': true,
                        'groups': [
                            {
                                'class': 'budget-parent',
                                'flows': [
                                    {
                                        'context': 'budget/0020/2019',
                                        'label': 'משרד החינוך ›',
                                        'size': 4890305000
                                    }
                                ],
                                'labelTextSize': 14,
                                'leftSide': false,
                                'offset': -100,
                                'roundness': 50,
                                'slope': 1.2,
                                'width': 1
                            },
                            {
                                'class': 'budget-expense',
                                'flows': [
                                    {
                                        'context': 'budget/00204607/2019',
                                        'label': '‹ תכניות מחוננים',
                                        'size': 53302000
                                    },
                                    {
                                        'context': 'budget/00204608/2019',
                                        'label': '‹ חינוך מבוגרים',
                                        'size': 62433000
                                    },
                                    {
                                        'context': 'budget/00204603/2019',
                                        'label': '‹ שירות פסיכולוגי-חינוכי',
                                        'size': 482706000
                                    },
                                    {
                                        'context': 'budget/00204606/2019',
                                        'label': '‹ תקשוב,טכנולוגיה ומדעים',
                                        'size': 556035000
                                    },
                                    {
                                        'context': 'budget/00204601/2019',
                                        'label': '‹ קידום ילדים ונוער',
                                        'size': 809243000
                                    },
                                    {
                                        'context': 'budget/00204604/2019',
                                        'label': '‹ חינוך בלתי פורמאלי',
                                        'size': 904410000
                                    },
                                    {
                                        'context': 'budget/00204602/2019',
                                        'label': '‹ פעילויות ופרויקטים',
                                        'size': 905529000
                                    },
                                    {
                                        'context': 'budget/00204605/2019',
                                        'label': '‹ הארכת יום הלימודים',
                                        'size': 1116647000
                                    }
                                ],
                                'labelTextSize': 14,
                                'leftSide': true,
                                'offset': 100,
                                'roundness': 50,
                                'slope': 1.2,
                                'width': 1
                            }
                        ],
                        'height': '640px',
                        'type': 'mushonkey',
                        'width': '100%'
                    },
                    'description': null,
                    'long_title': 'מהם תתי הסעיפים של סעיף זה?',
                    'title': 'מבנה התקציב',
                    'type': 'mushonkey'
                },
                {
                    'long_title': 'איך התקציב בסעיף זה השתנה לאורך השנים?',
                    'subcharts': [
                        {
                            'chart': [
                                {
                                    'mode': 'lines+markers',
                                    'name': 'תקציב מקורי',
                                    'x': [
                                        2015,
                                        2016,
                                        2017,
                                        2018,
                                        2019
                                    ],
                                    'y': [
                                        3525308000,
                                        3574175000,
                                        3680370000,
                                        3778178000,
                                        4890305000
                                    ]
                                },
                                {
                                    'mode': 'lines+markers',
                                    'name': 'אחרי שינויים',
                                    'x': [
                                        2015,
                                        2016,
                                        2017,
                                        2018,
                                        2019
                                    ],
                                    'y': [
                                        4141155000,
                                        4725366000,
                                        5697921000,
                                        6733610000,
                                        4890305000
                                    ]
                                },
                                {
                                    'mode': 'lines+markers',
                                    'name': 'ביצוע בפועל',
                                    'x': [
                                        2015,
                                        2016,
                                        2017,
                                        2018,
                                        2019
                                    ],
                                    'y': [
                                        2885847682,
                                        3291364739,
                                        4152293913,
                                        null,
                                        null
                                    ]
                                }
                            ],
                            'layout': {
                                'xaxis': {
                                    'title': 'שנה',
                                    'type': 'category'
                                },
                                'yaxis': {
                                    'rangemode': 'tozero',
                                    'separatethousands': true,
                                    'title': 'תקציב ב-₪'
                                }
                            },
                            'long_title': 'ערכי התקציב לאורך השנים (כפי שהופיעו בספרי התקציב)',
                            'title': 'נומינלית',
                            'type': 'plotly'
                        }
                    ],
                    'title': 'שינויי תקציב'
                },
                {
                    'chart': {
                        'centerHeight': 75,
                        'centerTitle': 'תכניות חינוכיות משלימות',
                        'centerWidth': 200,
                        'directionLeft': true,
                        'groups': [
                            {
                                'class': 'budget-expense',
                                'flows': [
                                    {
                                        'context': null,
                                        'label': 'שכר',
                                        'size': 131509000
                                    },
                                    {
                                        'context': null,
                                        'label': 'קניות ורכש',
                                        'size': 245387000
                                    },
                                    {
                                        'context': null,
                                        'label': 'העברות ותמיכות',
                                        'size': 4584876000
                                    }
                                ],
                                'labelTextSize': 14,
                                'leftSide': true,
                                'offset': 100,
                                'roundness': 50,
                                'slope': 1.2,
                                'width': 1
                            },
                            {
                                'class': 'budget-revenues',
                                'flows': [
                                    {
                                        'context': null,
                                        'label': 'העברות פנים תקציביות',
                                        'size': 71467000
                                    }
                                ],
                                'labelTextSize': 14,
                                'leftSide': false,
                                'offset': 100,
                                'roundness': 50,
                                'slope': 1.2,
                                'width': 0.8
                            }
                        ],
                        'height': '490px',
                        'type': 'mushonkey',
                        'width': '100%'
                    },
                    'long_title': 'באילו דרכים ושיטות מוציאים את הכסף בסעיף זה?',
                    'title': 'דרכי שימוש',
                    'type': 'mushonkey'
                }
            ],
            'children': [
                {
                    'code': '00204601',
                    'net_allocated': 809243000,
                    'net_revised': 809243000,
                    'title': 'קידום ילדים ונוער'
                },
                {
                    'code': '00204602',
                    'net_allocated': 905529000,
                    'net_revised': 905529000,
                    'title': 'פעילויות ופרויקטים'
                },
                {
                    'code': '00204603',
                    'net_allocated': 482706000,
                    'net_revised': 482706000,
                    'title': 'שירות פסיכולוגי-חינוכי'
                },
                {
                    'code': '00204604',
                    'net_allocated': 904410000,
                    'net_revised': 904410000,
                    'title': 'חינוך בלתי פורמאלי'
                },
                {
                    'code': '00204605',
                    'net_allocated': 1116647000,
                    'net_revised': 1116647000,
                    'title': 'הארכת יום הלימודים'
                },
                {
                    'code': '00204606',
                    'net_allocated': 556035000,
                    'net_revised': 556035000,
                    'title': 'תקשוב,טכנולוגיה ומדעים'
                },
                {
                    'code': '00204607',
                    'net_allocated': 53302000,
                    'net_revised': 53302000,
                    'title': 'תכניות מחוננים'
                },
                {
                    'code': '00204608',
                    'net_allocated': 62433000,
                    'net_revised': 62433000,
                    'title': 'חינוך מבוגרים'
                }
            ],
            'code': '002046',
            'commitment_allowance_allocated': 1358000000,
            'commitment_allowance_executed': null,
            'commitment_allowance_revised': 1358000000,
            'commitment_balance_allocated': null,
            'commitment_balance_executed': null,
            'commitment_balance_revised': null,
            'contractors_allocated': 0,
            'contractors_executed': null,
            'contractors_revised': 0,
            'dedicated_allocated': -560811000,
            'dedicated_executed': null,
            'dedicated_revised': -560811000,
            'depth': 2,
            'direction': [
                'הכנסה',
                'הוצאה'
            ],
            'doc_id': 'budget/002046/2019',
            'econ_cls_title_1': [
                'שכר',
                'הכנסות מיועדות',
                'קניות',
                'העברות',
                'העברות  פנים תקציביות'
            ],
            'econ_cls_title_2': [
                'קניות בחו"ל',
                'השתתפויות',
                'תמיכות לפי סעיף 3א',
                'שכר בארץ',
                'שכר עקיף',
                'מוצרים ציבוריים',
                'הכנסות תקציב רגיל',
                'רזרבה',
                'קניות בארץ'
            ],
            'explanation': null,
            'explanation_short': null,
            'explanation_source': null,
            'func_cls_title_1': [
                'שירותים חברתיים'
            ],
            'func_cls_title_2': [
                'חינוך'
            ],
            'gross_allocated': 560811000,
            'gross_executed': null,
            'gross_revised': 560811000,
            'hierarchy': [
                [
                    '00',
                    'המדינה'
                ],
                [
                    '0020',
                    'משרד החינוך'
                ]
            ],
            'history': {
                '2015': {
                    'amounts_allocated': 5095,
                    'amounts_executed': 0,
                    'amounts_revised': 5095,
                    'code_titles': [
                        '002046:תכניות חינוכיות משלימות'
                    ],
                    'commitment_allowance_allocated': 756064000,
                    'commitment_allowance_executed': 1435599398,
                    'commitment_allowance_revised': 1764903000,
                    'commitment_balance_executed': 2211444390,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': -326066000,
                    'dedicated_revised': -332163000,
                    'depth': 2,
                    'gross_allocated': 326066000,
                    'gross_revised': 332163000,
                    'net_allocated': 3525308000,
                    'net_executed': 2885847682,
                    'net_revised': 4141155000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 4226531000,
                    'total_direction_income': -85376000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_internal_transfers': -77137000,
                    'total_econ_cls_procurement': 242202000,
                    'total_econ_cls_salaries': 89355000,
                    'total_econ_cls_transfers': 3886735000
                },
                '2016': {
                    'amounts_allocated': 5250,
                    'amounts_executed': 0,
                    'amounts_revised': 5341,
                    'code_titles': [
                        '002046:תכניות חינוכיות משלימות'
                    ],
                    'commitment_allowance_allocated': 494387000,
                    'commitment_allowance_executed': 2032985734,
                    'commitment_allowance_revised': 2241842000,
                    'commitment_balance_executed': 3058149742,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': -326060000,
                    'dedicated_revised': -330331000,
                    'depth': 2,
                    'gross_allocated': 326060000,
                    'gross_revised': 330331000,
                    'net_allocated': 3574175000,
                    'net_executed': 3291364739,
                    'net_revised': 4725366000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 4812816000,
                    'total_direction_income': -87450000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_internal_transfers': -79525000,
                    'total_econ_cls_procurement': 345756000,
                    'total_econ_cls_salaries': 92877000,
                    'total_econ_cls_transfers': 4366258000
                },
                '2017': {
                    'amounts_allocated': 5340,
                    'amounts_executed': 0,
                    'amounts_revised': 5343,
                    'code_titles': [
                        '002046:תכניות חינוכיות משלימות'
                    ],
                    'commitment_allowance_allocated': 1909360000,
                    'commitment_allowance_executed': 1615112412,
                    'commitment_allowance_revised': 1953361000,
                    'commitment_balance_executed': 2932571617,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': -310587000,
                    'dedicated_revised': -384520000,
                    'depth': 2,
                    'gross_allocated': 310587000,
                    'gross_revised': 384520000,
                    'net_allocated': 3680370000,
                    'net_executed': 4152293913,
                    'net_revised': 5697921000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 5792613000,
                    'total_direction_income': -94692000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_internal_transfers': -87213000,
                    'total_econ_cls_procurement': 382138000,
                    'total_econ_cls_salaries': 91958000,
                    'total_econ_cls_transfers': 5311038000
                },
                '2018': {
                    'amounts_allocated': 5440,
                    'amounts_revised': 5440,
                    'code_titles': [
                        '002046:תכניות חינוכיות משלימות'
                    ],
                    'commitment_allowance_allocated': 1758000000,
                    'commitment_allowance_revised': 1820800000,
                    'contractors_allocated': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': -310587000,
                    'dedicated_revised': -758431000,
                    'depth': 2,
                    'gross_allocated': 310587000,
                    'gross_revised': 758431000,
                    'net_allocated': 3778178000,
                    'net_revised': 6733610000,
                    'personnel_allocated': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 6815555000,
                    'total_direction_income': -81945000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_internal_transfers': 1218573000,
                    'total_econ_cls_procurement': 924536000,
                    'total_econ_cls_salaries': 339054000,
                    'total_econ_cls_transfers': 4251447000
                }
            },
            'net_allocated': 4890305000,
            'net_executed': null,
            'net_revised': 4890305000,
            'nice-breadcrumbs': '2015 - 2019 / משרד החינוך',
            'nice-category': 'שירותים חברתיים / חינוך',
            'nice-code': '20.46',
            'nice-econ-category': 'העברות-תמיכות לפי סעיף 3א, קניות-קניות בחו"ל, העברות-שכר עקי' +
'ף, העברות-רזרבה, העברות-מוצרים ציבוריים, העברות  פנים תקציבי' +
'ות-השתתפויות, שכר-שכר בארץ, שכר-רזרבה, הכנסות מיועדות-הכנסות' +
' תקציב רגיל, קניות-קניות בארץ',
            'non_repeating': [
                0,
                1
            ],
            'page_title': 'תקציב תכניות חינוכיות משלימות (20.46)',
            'parent': '0020',
            'personnel_allocated': 0,
            'personnel_executed': null,
            'personnel_revised': 0,
            'rev_last_modified_at': '2018-12-03',
            'rev_last_updated_at': '2018-12-03',
            'score': 4890305,
            'semantic_tags': [],
            'simple-code': '2046',
            'title': 'תכניות חינוכיות משלימות',
            'total_direction_expense': 4969250000,
            'total_direction_income': -78945000,
            'total_econ_cls_capital_expenditure': null,
            'total_econ_cls_credit': null,
            'total_econ_cls_debt_repayment_interest': null,
            'total_econ_cls_debt_repayment_principal': null,
            'total_econ_cls_dedicated_income': 0,
            'total_econ_cls_income': null,
            'total_econ_cls_income_bank_of_israel': null,
            'total_econ_cls_income_grants': null,
            'total_econ_cls_income_loans': null,
            'total_econ_cls_interim_accounts': null,
            'total_econ_cls_internal_transfers': -71467000,
            'total_econ_cls_investment': null,
            'total_econ_cls_procurement': 245387000,
            'total_econ_cls_reserve': null,
            'total_econ_cls_salaries': 131509000,
            'total_econ_cls_transfers': 4584876000,
            'year': 2019
        },
        {
            '__created_at': null,
            '__date_range_from': '2019-01-01',
            '__date_range_months': [
                '2019-01',
                '2019-02',
                '2019-03',
                '2019-04',
                '2019-05',
                '2019-06',
                '2019-07',
                '2019-08',
                '2019-09',
                '2019-10',
                '2019-11',
                '2019-12'
            ],
            '__date_range_to': '2019-12-31',
            '__hash': '72c75b1a0a1205fb4a1c338a3b98d8d1',
            '__is_new': false,
            '__is_stale': false,
            '__last_modified_at': '2018-12-03T15:37:43Z',
            '__last_updated_at': '2018-12-03T15:37:43Z',
            '__next_update_days': 1,
            '__revision': 21,
            '__staleness': 150000,
            'admin_cls_code_0': [
                '1'
            ],
            'amounts_allocated': 1332,
            'amounts_executed': null,
            'amounts_revised': 1332,
            'charts': [
                {
                    'chart': {
                        'centerHeight': 75,
                        'centerTitle': 'חינוך בלתי פורמאלי',
                        'centerWidth': 200,
                        'directionLeft': true,
                        'groups': [
                            {
                                'class': 'budget-parent',
                                'flows': [
                                    {
                                        'context': 'budget/002046/2019',
                                        'label': 'תכניות חינוכיות משלימות ›',
                                        'size': 904410000
                                    }
                                ],
                                'labelTextSize': 14,
                                'leftSide': false,
                                'offset': -100,
                                'roundness': 50,
                                'slope': 1.2,
                                'width': 1
                            },
                            {
                                'class': 'budget-expense',
                                'flows': [
                                    {
                                        'context': 'budget/0020460402/2019',
                                        'label': '‹ תנועות נוער עולמיות',
                                        'size': 13000
                                    },
                                    {
                                        'context': 'budget/0020460430/2019',
                                        'label': '‹ יד בן צבי - סיורים בירושלים',
                                        'size': 292000
                                    },
                                    {
                                        'context': 'budget/0020460412/2019',
                                        'label': '‹ מורשת כוחות המגן',
                                        'size': 311000
                                    },
                                    {
                                        'context': 'budget/0020460415/2019',
                                        'label': '‹ תמיכות מוזאונים לשואה',
                                        'size': 314000
                                    },
                                    {
                                        'context': 'budget/0020460450/2019',
                                        'label': '‹ מכוני מנהיגות אזרחית',
                                        'size': 437000
                                    },
                                    {
                                        'context': 'budget/0020460401/2019',
                                        'label': '‹ הרשות לחילופי נוער',
                                        'size': 443000
                                    },
                                    {
                                        'context': 'budget/0020460411/2019',
                                        'label': '‹ הפעלת מתנדבים במערכת החינוך',
                                        'size': 459000
                                    },
                                    {
                                        'context': 'budget/0020460407/2019',
                                        'label': '‹ מדרשות שילוב',
                                        'size': 474000
                                    },
                                    {
                                        'context': 'budget/0020460439/2019',
                                        'label': '‹ תוכניות פנאי לנכים',
                                        'size': 923000
                                    },
                                    {
                                        'context': 'budget/0020460433/2019',
                                        'label': '‹ חוגי סיור',
                                        'size': 1003000
                                    },
                                    {
                                        'context': 'budget/0020460443/2019',
                                        'label': '‹ תמיכה במרכז למחקר ולהוראת הטבע והנוף על פי מורשת ישראל',
                                        'size': 1014000
                                    },
                                    {
                                        'context': 'budget/0020460422/2019',
                                        'label': '‹ פעילויות לא פורמליות ברשויות המקומיות - הקצבות',
                                        'size': 1073000
                                    },
                                    {
                                        'context': 'budget/0020460426/2019',
                                        'label': '‹ קידום מנהיגות צעירה',
                                        'size': 2011000
                                    },
                                    {
                                        'context': 'budget/0020460406/2019',
                                        'label': '‹ מפגשים בין תלמידים וצעירים מאוכלוסיות שונות',
                                        'size': 2250000
                                    },
                                    {
                                        'context': 'budget/0020460431/2019',
                                        'label': '‹ הקצאת שעות לבתי ספר לפרוייקטים',
                                        'size': 3563000
                                    },
                                    {
                                        'context': 'budget/0020460425/2019',
                                        'label': '‹ תמיכה באכסניות חינוכיות לילדים ונוער',
                                        'size': 3977000
                                    },
                                    {
                                        'context': 'budget/0020460416/2019',
                                        'label': '‹ תכנית נוער בוחר ערך כדרך',
                                        'size': 4719000
                                    },
                                    {
                                        'context': 'budget/0020460419/2019',
                                        'label': '‹ פעולות עם נוער בסיכון',
                                        'size': 6192000
                                    },
                                    {
                                        'context': 'budget/0020460435/2019',
                                        'label': '‹ תמיכה במוזיאונים',
                                        'size': 6260000
                                    },
                                    {
                                        'context': 'budget/0020460432/2019',
                                        'label': '‹ פעולות של"ח (שדה, לאום, חברה)',
                                        'size': 8244000
                                    },
                                    {
                                        'context': 'budget/0020460434/2019',
                                        'label': '‹ תעודת בגרות חברתית',
                                        'size': 8354000
                                    },
                                    {
                                        'context': 'budget/0020460410/2019',
                                        'label': '‹ פעילות התנדבותית למען הקהילה של תלמידי י"א-י"ב',
                                        'size': 8490000
                                    },
                                    {
                                        'context': 'budget/0020460424/2019',
                                        'label': '‹ מכינות אופק לנוער בסיכון',
                                        'size': 12106000
                                    },
                                    {
                                        'context': 'budget/0020460429/2019',
                                        'label': '‹ פעולות מינהל חברה ונוער',
                                        'size': 12321000
                                    },
                                    {
                                        'context': 'budget/0020460440/2019',
                                        'label': '‹ השתתפות במכינות קדם אקדמיות',
                                        'size': 13117000
                                    },
                                    {
                                        'context': 'budget/0020460423/2019',
                                        'label': '‹ תמיכה במוסדות ציבור בתחומי הדרכה, סיורים חינוכיים, טבע וסב' +
'יבה',
                                        'size': 13392000
                                    },
                                    {
                                        'context': 'budget/0020460442/2019',
                                        'label': '‹ תמיכה במדריכים מוסיקליים בקונסרבטוריונים',
                                        'size': 18981000
                                    },
                                    {
                                        'context': 'budget/0020460409/2019',
                                        'label': '‹ הפעלת קבוצת מחנכים',
                                        'size': 19707000
                                    },
                                    {
                                        'context': 'budget/0020460413/2019',
                                        'label': '‹ תכנית המסע הישראלי',
                                        'size': 19788000
                                    },
                                    {
                                        'context': 'budget/0020460421/2019',
                                        'label': '‹ המסע לפולין',
                                        'size': 19905000
                                    },
                                    {
                                        'context': 'budget/0020460428/2019',
                                        'label': '‹ חוק הנוער',
                                        'size': 20004000
                                    },
                                    {
                                        'context': 'budget/0020460436/2019',
                                        'label': '‹ סל תרבות',
                                        'size': 22186000
                                    },
                                    {
                                        'context': 'budget/0020460452/2019',
                                        'label': '‹ קידום תכניות בחינוך הבלתי פורמאלי',
                                        'size': 38800000
                                    },
                                    {
                                        'context': 'budget/0020460438/2019',
                                        'label': '‹ סיוע וטיפוח',
                                        'size': 39387000
                                    },
                                    {
                                        'context': 'budget/0020460420/2019',
                                        'label': '‹ תמיכה בארגוני נוער',
                                        'size': 39414000
                                    },
                                    {
                                        'context': 'budget/0020460408/2019',
                                        'label': '‹ מתנדבים לשנת שירות',
                                        'size': 55902000
                                    },
                                    {
                                        'context': 'budget/0020460414/2019',
                                        'label': '‹ מדריכי של"ח (שדה, לאום, חברה) 15,840 שעות (660 משרות)',
                                        'size': 78104000
                                    },
                                    {
                                        'context': 'budget/0020460403/2019',
                                        'label': '‹ מכינות קדם צבאיות',
                                        'size': 84000000
                                    },
                                    {
                                        'context': 'budget/0020460418/2019',
                                        'label': '‹ תמיכה בתנועות נוער',
                                        'size': 110163000
                                    },
                                    {
                                        'context': 'budget/0020460451/2019',
                                        'label': '‹ תכניות בחינוך הבלתי פוראמלי',
                                        'size': 125843000
                                    },
                                    {
                                        'context': 'budget/0020460405/2019',
                                        'label': '‹ החברה למתנ"סים',
                                        'size': 142474000
                                    }
                                ],
                                'labelTextSize': 14,
                                'leftSide': true,
                                'offset': 100,
                                'roundness': 50,
                                'slope': 1.2,
                                'width': 1
                            },
                            {
                                'class': 'budget-revenues',
                                'flows': [
                                    {
                                        'context': 'budget/0020460404/2019',
                                        'label': '‹ השתתפות משרד הביטחון במכינות קדם צבאיות',
                                        'size': 42000000
                                    }
                                ],
                                'labelTextSize': 14,
                                'leftSide': false,
                                'offset': 100,
                                'roundness': 50,
                                'slope': 1.2,
                                'width': 0.8
                            }
                        ],
                        'height': '1630px',
                        'type': 'mushonkey',
                        'width': '100%'
                    },
                    'description': null,
                    'long_title': 'מהם תתי הסעיפים של סעיף זה?',
                    'title': 'מבנה התקציב',
                    'type': 'mushonkey'
                },
                {
                    'long_title': 'איך התקציב בסעיף זה השתנה לאורך השנים?',
                    'subcharts': [
                        {
                            'chart': [
                                {
                                    'mode': 'lines+markers',
                                    'name': 'תקציב מקורי',
                                    'x': [
                                        2015,
                                        2016,
                                        2017,
                                        2018,
                                        2019
                                    ],
                                    'y': [
                                        569916000,
                                        594788000,
                                        802157000,
                                        807152000,
                                        904410000
                                    ]
                                },
                                {
                                    'mode': 'lines+markers',
                                    'name': 'אחרי שינויים',
                                    'x': [
                                        2015,
                                        2016,
                                        2017,
                                        2018,
                                        2019
                                    ],
                                    'y': [
                                        724831000,
                                        940448000,
                                        1218962000,
                                        1261736000,
                                        904410000
                                    ]
                                },
                                {
                                    'mode': 'lines+markers',
                                    'name': 'ביצוע בפועל',
                                    'x': [
                                        2015,
                                        2016,
                                        2017,
                                        2018,
                                        2019
                                    ],
                                    'y': [
                                        546152707,
                                        620492270,
                                        821285811,
                                        null,
                                        null
                                    ]
                                }
                            ],
                            'layout': {
                                'xaxis': {
                                    'title': 'שנה',
                                    'type': 'category'
                                },
                                'yaxis': {
                                    'rangemode': 'tozero',
                                    'separatethousands': true,
                                    'title': 'תקציב ב-₪'
                                }
                            },
                            'long_title': 'ערכי התקציב לאורך השנים (כפי שהופיעו בספרי התקציב)',
                            'title': 'נומינלית',
                            'type': 'plotly'
                        }
                    ],
                    'title': 'שינויי תקציב'
                },
                {
                    'chart': {
                        'centerHeight': 75,
                        'centerTitle': 'חינוך בלתי פורמאלי',
                        'centerWidth': 200,
                        'directionLeft': true,
                        'groups': [
                            {
                                'class': 'budget-expense',
                                'flows': [
                                    {
                                        'context': null,
                                        'label': 'קניות ורכש',
                                        'size': 19905000
                                    },
                                    {
                                        'context': null,
                                        'label': 'שכר',
                                        'size': 78104000
                                    },
                                    {
                                        'context': null,
                                        'label': 'העברות ותמיכות',
                                        'size': 848401000
                                    }
                                ],
                                'labelTextSize': 14,
                                'leftSide': true,
                                'offset': 100,
                                'roundness': 50,
                                'slope': 1.2,
                                'width': 1
                            },
                            {
                                'class': 'budget-revenues',
                                'flows': [
                                    {
                                        'context': null,
                                        'label': 'העברות פנים תקציביות',
                                        'size': 42000000
                                    }
                                ],
                                'labelTextSize': 14,
                                'leftSide': false,
                                'offset': 100,
                                'roundness': 50,
                                'slope': 1.2,
                                'width': 0.8
                            }
                        ],
                        'height': '490px',
                        'type': 'mushonkey',
                        'width': '100%'
                    },
                    'long_title': 'באילו דרכים ושיטות מוציאים את הכסף בסעיף זה?',
                    'title': 'דרכי שימוש',
                    'type': 'mushonkey'
                }
            ],
            'children': [
                {
                    'code': '0020460401',
                    'net_allocated': 443000,
                    'net_revised': 443000,
                    'title': 'הרשות לחילופי נוער'
                },
                {
                    'code': '0020460402',
                    'net_allocated': 13000,
                    'net_revised': 13000,
                    'title': 'תנועות נוער עולמיות'
                },
                {
                    'code': '0020460403',
                    'net_allocated': 84000000,
                    'net_revised': 84000000,
                    'title': 'מכינות קדם צבאיות'
                },
                {
                    'code': '0020460404',
                    'net_allocated': -42000000,
                    'net_revised': -42000000,
                    'title': 'השתתפות משרד הביטחון במכינות קדם צבאיות'
                },
                {
                    'code': '0020460405',
                    'net_allocated': 142474000,
                    'net_revised': 142474000,
                    'title': 'החברה למתנ"סים'
                },
                {
                    'code': '0020460406',
                    'net_allocated': 2250000,
                    'net_revised': 2250000,
                    'title': 'מפגשים בין תלמידים וצעירים מאוכלוסיות שונות'
                },
                {
                    'code': '0020460407',
                    'net_allocated': 474000,
                    'net_revised': 474000,
                    'title': 'מדרשות שילוב'
                },
                {
                    'code': '0020460408',
                    'net_allocated': 55902000,
                    'net_revised': 55902000,
                    'title': 'מתנדבים לשנת שירות'
                },
                {
                    'code': '0020460409',
                    'net_allocated': 19707000,
                    'net_revised': 19707000,
                    'title': 'הפעלת קבוצת מחנכים'
                },
                {
                    'code': '0020460410',
                    'net_allocated': 8490000,
                    'net_revised': 8490000,
                    'title': 'פעילות התנדבותית למען הקהילה של תלמידי י"א-י"ב'
                },
                {
                    'code': '0020460411',
                    'net_allocated': 459000,
                    'net_revised': 459000,
                    'title': 'הפעלת מתנדבים במערכת החינוך'
                },
                {
                    'code': '0020460412',
                    'net_allocated': 311000,
                    'net_revised': 311000,
                    'title': 'מורשת כוחות המגן'
                },
                {
                    'code': '0020460413',
                    'net_allocated': 19788000,
                    'net_revised': 19788000,
                    'title': 'תכנית המסע הישראלי'
                },
                {
                    'code': '0020460414',
                    'net_allocated': 78104000,
                    'net_revised': 78104000,
                    'title': 'מדריכי של"ח (שדה, לאום, חברה) 15,840 שעות (660 משרות)'
                },
                {
                    'code': '0020460415',
                    'net_allocated': 314000,
                    'net_revised': 314000,
                    'title': 'תמיכות מוזאונים לשואה'
                },
                {
                    'code': '0020460416',
                    'net_allocated': 4719000,
                    'net_revised': 4719000,
                    'title': 'תכנית נוער בוחר ערך כדרך'
                },
                {
                    'code': '0020460417',
                    'net_allocated': 0,
                    'net_revised': 0,
                    'title': 'אתגרים-פעילות עם הרשויות'
                },
                {
                    'code': '0020460418',
                    'net_allocated': 110163000,
                    'net_revised': 110163000,
                    'title': 'תמיכה בתנועות נוער'
                },
                {
                    'code': '0020460419',
                    'net_allocated': 6192000,
                    'net_revised': 6192000,
                    'title': 'פעולות עם נוער בסיכון'
                },
                {
                    'code': '0020460420',
                    'net_allocated': 39414000,
                    'net_revised': 39414000,
                    'title': 'תמיכה בארגוני נוער'
                },
                {
                    'code': '0020460421',
                    'net_allocated': 19905000,
                    'net_revised': 19905000,
                    'title': 'המסע לפולין'
                },
                {
                    'code': '0020460422',
                    'net_allocated': 1073000,
                    'net_revised': 1073000,
                    'title': 'פעילויות לא פורמליות ברשויות המקומיות - הקצבות'
                },
                {
                    'code': '0020460423',
                    'net_allocated': 13392000,
                    'net_revised': 13392000,
                    'title': 'תמיכה במוסדות ציבור בתחומי הדרכה, סיורים חינוכיים, טבע וסביב' +
'ה'
                },
                {
                    'code': '0020460424',
                    'net_allocated': 12106000,
                    'net_revised': 12106000,
                    'title': 'מכינות אופק לנוער בסיכון'
                },
                {
                    'code': '0020460425',
                    'net_allocated': 3977000,
                    'net_revised': 3977000,
                    'title': 'תמיכה באכסניות חינוכיות לילדים ונוער'
                },
                {
                    'code': '0020460426',
                    'net_allocated': 2011000,
                    'net_revised': 2011000,
                    'title': 'קידום מנהיגות צעירה'
                },
                {
                    'code': '0020460427',
                    'net_allocated': 0,
                    'net_revised': 0,
                    'title': 'הכנסה מגורמי חוץ'
                },
                {
                    'code': '0020460428',
                    'net_allocated': 20004000,
                    'net_revised': 20004000,
                    'title': 'חוק הנוער'
                },
                {
                    'code': '0020460429',
                    'net_allocated': 12321000,
                    'net_revised': 12321000,
                    'title': 'פעולות מינהל חברה ונוער'
                },
                {
                    'code': '0020460430',
                    'net_allocated': 292000,
                    'net_revised': 292000,
                    'title': 'יד בן צבי - סיורים בירושלים'
                },
                {
                    'code': '0020460431',
                    'net_allocated': 3563000,
                    'net_revised': 3563000,
                    'title': 'הקצאת שעות לבתי ספר לפרוייקטים'
                },
                {
                    'code': '0020460432',
                    'net_allocated': 8244000,
                    'net_revised': 8244000,
                    'title': 'פעולות של"ח (שדה, לאום, חברה)'
                },
                {
                    'code': '0020460433',
                    'net_allocated': 1003000,
                    'net_revised': 1003000,
                    'title': 'חוגי סיור'
                },
                {
                    'code': '0020460434',
                    'net_allocated': 8354000,
                    'net_revised': 8354000,
                    'title': 'תעודת בגרות חברתית'
                },
                {
                    'code': '0020460435',
                    'net_allocated': 6260000,
                    'net_revised': 6260000,
                    'title': 'תמיכה במוזיאונים'
                },
                {
                    'code': '0020460436',
                    'net_allocated': 22186000,
                    'net_revised': 22186000,
                    'title': 'סל תרבות'
                },
                {
                    'code': '0020460437',
                    'net_allocated': 0,
                    'net_revised': 0,
                    'title': 'הכנסות מגורמי חוץ'
                },
                {
                    'code': '0020460438',
                    'net_allocated': 39387000,
                    'net_revised': 39387000,
                    'title': 'סיוע וטיפוח'
                },
                {
                    'code': '0020460439',
                    'net_allocated': 923000,
                    'net_revised': 923000,
                    'title': 'תוכניות פנאי לנכים'
                },
                {
                    'code': '0020460440',
                    'net_allocated': 13117000,
                    'net_revised': 13117000,
                    'title': 'השתתפות במכינות קדם אקדמיות'
                },
                {
                    'code': '0020460441',
                    'net_allocated': 0,
                    'net_revised': 0,
                    'title': 'מרכזים קהילתיים בקשיים לאזורים סמוכי גבול'
                },
                {
                    'code': '0020460442',
                    'net_allocated': 18981000,
                    'net_revised': 18981000,
                    'title': 'תמיכה במדריכים מוסיקליים בקונסרבטוריונים'
                },
                {
                    'code': '0020460443',
                    'net_allocated': 1014000,
                    'net_revised': 1014000,
                    'title': 'תמיכה במרכז למחקר ולהוראת הטבע והנוף על פי מורשת ישראל'
                },
                {
                    'code': '0020460446',
                    'net_allocated': 0,
                    'net_revised': 0,
                    'title': 'צמצום פערים בפריפריה'
                },
                {
                    'code': '0020460448',
                    'net_allocated': 0,
                    'net_revised': 0,
                    'title': 'כפרי סטודנטים'
                },
                {
                    'code': '0020460449',
                    'net_allocated': 0,
                    'net_revised': 0,
                    'title': 'החברה למתנסים - התחייבות יחסי עובד מעביד'
                },
                {
                    'code': '0020460450',
                    'net_allocated': 437000,
                    'net_revised': 437000,
                    'title': 'מכוני מנהיגות אזרחית'
                },
                {
                    'code': '0020460451',
                    'net_allocated': 125843000,
                    'net_revised': 125843000,
                    'title': 'תכניות בחינוך הבלתי פוראמלי'
                },
                {
                    'code': '0020460452',
                    'net_allocated': 38800000,
                    'net_revised': 38800000,
                    'title': 'קידום תכניות בחינוך הבלתי פורמאלי'
                }
            ],
            'code': '00204604',
            'commitment_allowance_allocated': 0,
            'commitment_allowance_executed': null,
            'commitment_allowance_revised': 0,
            'commitment_balance_allocated': null,
            'commitment_balance_executed': null,
            'commitment_balance_revised': null,
            'contractors_allocated': 0,
            'contractors_executed': null,
            'contractors_revised': 0,
            'dedicated_allocated': -9000000,
            'dedicated_executed': null,
            'dedicated_revised': -9000000,
            'depth': 3,
            'direction': [
                'הכנסה',
                'הוצאה'
            ],
            'doc_id': 'budget/00204604/2019',
            'econ_cls_title_1': [
                'שכר',
                'הכנסות מיועדות',
                'קניות',
                'העברות',
                'העברות  פנים תקציביות'
            ],
            'econ_cls_title_2': [
                'השתתפויות',
                'תמיכות לפי סעיף 3א',
                'שכר בארץ',
                'שכר עקיף',
                'מוצרים ציבוריים',
                'הכנסות תקציב רגיל',
                'קניות בארץ'
            ],
            'explanation': null,
            'explanation_short': null,
            'explanation_source': null,
            'func_cls_title_1': [
                'שירותים חברתיים'
            ],
            'func_cls_title_2': [
                'חינוך'
            ],
            'gross_allocated': 9000000,
            'gross_executed': null,
            'gross_revised': 9000000,
            'hierarchy': [
                [
                    '00',
                    'המדינה'
                ],
                [
                    '0020',
                    'משרד החינוך'
                ],
                [
                    '002046',
                    'תכניות חינוכיות משלימות'
                ]
            ],
            'history': {
                '2015': {
                    'amounts_allocated': 1286,
                    'amounts_executed': 0,
                    'amounts_revised': 1286,
                    'code_titles': [
                        '00204604:חינוך בלתי פורמאלי'
                    ],
                    'commitment_allowance_allocated': 280000000,
                    'commitment_allowance_executed': 279999999,
                    'commitment_allowance_revised': 280000000,
                    'commitment_balance_executed': 344545440,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': -28800000,
                    'dedicated_revised': -25930000,
                    'depth': 3,
                    'gross_allocated': 28800000,
                    'gross_revised': 25930000,
                    'net_allocated': 569916000,
                    'net_executed': 546152707,
                    'net_revised': 724831000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 769590000,
                    'total_direction_income': -44759000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_internal_transfers': -44759000,
                    'total_econ_cls_procurement': 1392000,
                    'total_econ_cls_salaries': 68473000,
                    'total_econ_cls_transfers': 699725000
                },
                '2016': {
                    'amounts_allocated': 1332,
                    'amounts_executed': 0,
                    'amounts_revised': 1420,
                    'code_titles': [
                        '00204604:חינוך בלתי פורמאלי'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 0,
                    'commitment_balance_executed': 349885078,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': -28800000,
                    'dedicated_revised': -26500000,
                    'depth': 3,
                    'gross_allocated': 28800000,
                    'gross_revised': 26500000,
                    'net_allocated': 594788000,
                    'net_executed': 620492270,
                    'net_revised': 940448000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 978791000,
                    'total_direction_income': -38343000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_internal_transfers': -38343000,
                    'total_econ_cls_procurement': 17025000,
                    'total_econ_cls_salaries': 73242000,
                    'total_econ_cls_transfers': 888524000
                },
                '2017': {
                    'amounts_allocated': 1332,
                    'amounts_executed': 0,
                    'amounts_revised': 1332,
                    'code_titles': [
                        '00204604:חינוך בלתי פורמאלי'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 1000,
                    'commitment_balance_executed': 427914363,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': -25800000,
                    'dedicated_revised': -3800000,
                    'depth': 3,
                    'gross_allocated': 25800000,
                    'gross_revised': 3800000,
                    'net_allocated': 802157000,
                    'net_executed': 821285811,
                    'net_revised': 1218962000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 1258962000,
                    'total_direction_income': -40000000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_internal_transfers': -40000000,
                    'total_econ_cls_procurement': 24984000,
                    'total_econ_cls_salaries': 72420000,
                    'total_econ_cls_transfers': 1161558000
                },
                '2018': {
                    'amounts_allocated': 1332,
                    'amounts_revised': 1332,
                    'code_titles': [
                        '00204604:חינוך בלתי פורמאלי'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_revised': 0,
                    'contractors_allocated': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': -25800000,
                    'dedicated_revised': -10000000,
                    'depth': 3,
                    'gross_allocated': 25800000,
                    'gross_revised': 10000000,
                    'net_allocated': 807152000,
                    'net_revised': 1261736000,
                    'personnel_allocated': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 1301736000,
                    'total_direction_income': -40000000,
                    'total_econ_cls_dedicated_income': 0,
                    'total_econ_cls_internal_transfers': -40000000,
                    'total_econ_cls_procurement': 165843000,
                    'total_econ_cls_salaries': 76199000,
                    'total_econ_cls_transfers': 1059694000
                }
            },
            'net_allocated': 904410000,
            'net_executed': null,
            'net_revised': 904410000,
            'nice-breadcrumbs': '2015 - 2019 / משרד החינוך / תכניות חינוכיות משלימות',
            'nice-category': 'שירותים חברתיים / חינוך',
            'nice-code': '20.46.04',
            'nice-econ-category': 'העברות-תמיכות לפי סעיף 3א, העברות-שכר עקיף, העברות-מוצרים צי' +
'בוריים, העברות  פנים תקציביות-השתתפויות, שכר-שכר בארץ, הכנסו' +
'ת מיועדות-הכנסות תקציב רגיל, קניות-קניות בארץ',
            'non_repeating': [
                0
            ],
            'page_title': 'תקציב חינוך בלתי פורמאלי (20.46.04)',
            'parent': '002046',
            'personnel_allocated': 0,
            'personnel_executed': null,
            'personnel_revised': 0,
            'rev_last_modified_at': '2018-12-03',
            'rev_last_updated_at': '2018-12-03',
            'score': 904410,
            'semantic_tags': [
                'הדרכה אימון הוראה הכשרה חינוך חניכה לימוד קורס בלתי פורמאלי'
            ],
            'simple-code': '204604',
            'title': 'חינוך בלתי פורמאלי',
            'total_direction_expense': 946410000,
            'total_direction_income': -42000000,
            'total_econ_cls_capital_expenditure': null,
            'total_econ_cls_credit': null,
            'total_econ_cls_debt_repayment_interest': null,
            'total_econ_cls_debt_repayment_principal': null,
            'total_econ_cls_dedicated_income': 0,
            'total_econ_cls_income': null,
            'total_econ_cls_income_bank_of_israel': null,
            'total_econ_cls_income_grants': null,
            'total_econ_cls_income_loans': null,
            'total_econ_cls_interim_accounts': null,
            'total_econ_cls_internal_transfers': -42000000,
            'total_econ_cls_investment': null,
            'total_econ_cls_procurement': 19905000,
            'total_econ_cls_reserve': null,
            'total_econ_cls_salaries': 78104000,
            'total_econ_cls_transfers': 848401000,
            'year': 2019
        }
    ],
    'supportChart': [
        [
            {
                'entity_name': 'הסתדרות הנוער עובד והלומד ליד הסתדרות העובדים הכללית החדשה (' +
'ע"ר)',
                'href': 'https://next.obudget.org/i/org/association/580297075',
                'total_amount': 73067184
            },
            {
                'entity_name': 'תנועת הצופים העבריים בישראל (ע"ר)',
                'href': 'https://next.obudget.org/i/org/association/580028454',
                'total_amount': 61946577
            },
            {
                'entity_name': 'תנועת בני עקיבא בישראל (ע"ר)',
                'href': 'https://next.obudget.org/i/org/association/580040343',
                'total_amount': 51733389
            },
            {
                'entity_name': 'עמותת תנועת הנוער הדרוזי בישראל (ע"ר)',
                'href': 'https://next.obudget.org/i/org/association/580300432',
                'total_amount': 16017961
            },
            {
                'entity_name': 'הסתדרות השומר הצעיר בישראל',
                'href': 'https://next.obudget.org/i/org/association/580001659',
                'total_amount': 14758099
            },
            {
                'entity_name': 'תנועת הצופים הערבים בישראל (ע"ר)',
                'href': 'https://next.obudget.org/i/org/association/580383834',
                'total_amount': 13658415
            },
            {
                'entity_name': 'עזרא תנועת הנוער התורני לאומי בארץ-ישראל (ע"ר)',
                'href': 'https://next.obudget.org/i/org/association/580043297',
                'total_amount': 13110686
            },
            {
                'entity_name': 'מועצת תנועות הנוער בישראל',
                'href': 'https://next.obudget.org/i/org/association/580019982',
                'total_amount': 10877403
            },
            {
                'entity_name': 'הנוער הלאומי - בית"ר (ע"ר)',
                'href': 'https://next.obudget.org/i/org/association/580038685',
                'total_amount': 9119779
            },
            {
                'entity_name': 'אריאל - תנועת נוער ישראלית (ע"ר)',
                'href': 'https://next.obudget.org/i/org/association/580004562',
                'total_amount': 7824415
            },
            {
                'entity_name': 'תנועת הנוער של האיחוד החקלאי (ע"ר)',
                'href': 'https://next.obudget.org/i/org/association/580083046',
                'total_amount': 6950535
            },
            {
                'entity_name': 'היכלי ענ"ג - תנועת נוער (ע"ר)',
                'href': 'https://next.obudget.org/i/org/association/580398279',
                'total_amount': 6153894
            },
            {
                'entity_name': 'המחנות העולים',
                'href': 'https://next.obudget.org/i/org/association/580240489',
                'total_amount': 5462145
            },
            {
                'entity_name': 'תנועת המכבי הצעיר (ע"ר)',
                'href': 'https://next.obudget.org/i/org/association/580308930',
                'total_amount': 4943632
            }
        ],
        {
            '__created_at': null,
            '__date_range_from': '2019-01-01',
            '__date_range_months': [
                '2019-01',
                '2019-02',
                '2019-03',
                '2019-04',
                '2019-05',
                '2019-06',
                '2019-07',
                '2019-08',
                '2019-09',
                '2019-10',
                '2019-11',
                '2019-12'
            ],
            '__date_range_to': '2019-12-31',
            '__hash': '6de81dab52853c7909121289c3633f8f',
            '__is_new': false,
            '__is_stale': false,
            '__last_modified_at': '2018-12-02T19:26:22Z',
            '__last_updated_at': '2018-12-02T19:26:22Z',
            '__next_update_days': 1,
            '__revision': 21,
            '__staleness': 150000,
            'admin_cls_code_0': [
                '1'
            ],
            'amounts_allocated': 0,
            'amounts_executed': null,
            'amounts_revised': 0,
            'charts': [
                {
                    'long_title': 'איך התקציב בסעיף זה השתנה לאורך השנים?',
                    'subcharts': [
                        {
                            'chart': [
                                {
                                    'mode': 'lines+markers',
                                    'name': 'תקציב מקורי',
                                    'x': [
                                        1997,
                                        1998,
                                        1999,
                                        2000,
                                        2001,
                                        2002,
                                        2003,
                                        2004,
                                        2005,
                                        2006,
                                        2007,
                                        2008,
                                        2009,
                                        2010,
                                        2011,
                                        2012,
                                        2013,
                                        2014,
                                        2015,
                                        2016,
                                        2017,
                                        2018,
                                        2019
                                    ],
                                    'y': [
                                        21532000,
                                        26895000,
                                        36660000,
                                        45847000,
                                        46422000,
                                        45812000,
                                        32468000,
                                        36494000,
                                        35574000,
                                        33944000,
                                        48762000,
                                        39185000,
                                        64480000,
                                        59989000,
                                        64424000,
                                        64097000,
                                        84653000,
                                        85093000,
                                        87599000,
                                        97622000,
                                        97901000,
                                        98665000,
                                        110163000
                                    ]
                                },
                                {
                                    'mode': 'lines+markers',
                                    'name': 'אחרי שינויים',
                                    'x': [
                                        1997,
                                        1998,
                                        1999,
                                        2000,
                                        2001,
                                        2002,
                                        2003,
                                        2004,
                                        2005,
                                        2006,
                                        2007,
                                        2008,
                                        2009,
                                        2010,
                                        2011,
                                        2012,
                                        2013,
                                        2014,
                                        2015,
                                        2016,
                                        2017,
                                        2018,
                                        2019
                                    ],
                                    'y': [
                                        23082000,
                                        31067000,
                                        36664000,
                                        45847000,
                                        66783000,
                                        55524000,
                                        57718000,
                                        52013000,
                                        54605000,
                                        50711000,
                                        76985000,
                                        72410000,
                                        68900000,
                                        70659000,
                                        78614000,
                                        95101000,
                                        94807000,
                                        98873000,
                                        99135000,
                                        105873000,
                                        118623000,
                                        98665000,
                                        110163000
                                    ]
                                },
                                {
                                    'mode': 'lines+markers',
                                    'name': 'ביצוע בפועל',
                                    'x': [
                                        1997,
                                        1998,
                                        1999,
                                        2000,
                                        2001,
                                        2002,
                                        2003,
                                        2004,
                                        2005,
                                        2006,
                                        2007,
                                        2008,
                                        2009,
                                        2010,
                                        2011,
                                        2012,
                                        2013,
                                        2014,
                                        2015,
                                        2016,
                                        2017,
                                        2018,
                                        2019
                                    ],
                                    'y': [
                                        20755756,
                                        28745397,
                                        36663995,
                                        43889262,
                                        65820535,
                                        55140340,
                                        56497624,
                                        51883992,
                                        53550439,
                                        47517359,
                                        74837775,
                                        71166609,
                                        66814153,
                                        68614952,
                                        74141932,
                                        88546994,
                                        89545129,
                                        88838100,
                                        96485053,
                                        98274638,
                                        108950826,
                                        null,
                                        null
                                    ]
                                }
                            ],
                            'layout': {
                                'xaxis': {
                                    'title': 'שנה',
                                    'type': 'category'
                                },
                                'yaxis': {
                                    'rangemode': 'tozero',
                                    'separatethousands': true,
                                    'title': 'תקציב ב-₪'
                                }
                            },
                            'long_title': 'ערכי התקציב לאורך השנים (כפי שהופיעו בספרי התקציב)',
                            'title': 'נומינלית',
                            'type': 'plotly'
                        }
                    ],
                    'title': 'שינויי תקציב'
                },
                {
                    'chart': {
                        'centerHeight': 75,
                        'centerTitle': 'תמיכה בתנועות נוער',
                        'centerWidth': 200,
                        'directionLeft': true,
                        'groups': [
                            {
                                'class': 'budget-expense',
                                'flows': [
                                    {
                                        'context': null,
                                        'label': 'העברות ותמיכות',
                                        'size': 110163000
                                    }
                                ],
                                'labelTextSize': 14,
                                'leftSide': true,
                                'offset': 100,
                                'roundness': 50,
                                'slope': 1.2,
                                'width': 1
                            }
                        ],
                        'height': '430px',
                        'type': 'mushonkey',
                        'width': '100%'
                    },
                    'long_title': 'באילו דרכים ושיטות מוציאים את הכסף בסעיף זה?',
                    'title': 'דרכי שימוש',
                    'type': 'mushonkey'
                }
            ],
            'children': null,
            'code': '0020460418',
            'commitment_allowance_allocated': 0,
            'commitment_allowance_executed': null,
            'commitment_allowance_revised': 0,
            'commitment_balance_allocated': null,
            'commitment_balance_executed': null,
            'commitment_balance_revised': null,
            'contractors_allocated': 0,
            'contractors_executed': null,
            'contractors_revised': 0,
            'dedicated_allocated': 0,
            'dedicated_executed': null,
            'dedicated_revised': 0,
            'depth': 4,
            'direction': [
                'הוצאה'
            ],
            'doc_id': 'budget/0020460418/2019',
            'econ_cls_title_1': [
                'העברות'
            ],
            'econ_cls_title_2': [
                'תמיכות לפי סעיף 3א'
            ],
            'explanation': null,
            'explanation_short': null,
            'explanation_source': null,
            'func_cls_title_1': [
                'שירותים חברתיים'
            ],
            'func_cls_title_2': [
                'חינוך'
            ],
            'gross_allocated': 0,
            'gross_executed': null,
            'gross_revised': 0,
            'hierarchy': [
                [
                    '00',
                    'המדינה'
                ],
                [
                    '0020',
                    'משרד החינוך'
                ],
                [
                    '002046',
                    'תכניות חינוכיות משלימות'
                ],
                [
                    '00204604',
                    'חינוך בלתי פורמאלי'
                ]
            ],
            'history': {
                '1997': {
                    'amounts_allocated': 0,
                    'amounts_executed': 0,
                    'amounts_revised': 0,
                    'code_titles': [
                        '0020241447:תנועות נוער - השתתפות והחזקה - תמיכה'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 0,
                    'commitment_balance_executed': 2326241,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': 0,
                    'dedicated_revised': 0,
                    'depth': 4,
                    'gross_allocated': 0,
                    'gross_revised': 0,
                    'net_allocated': 21532000,
                    'net_executed': 20755756,
                    'net_revised': 23082000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 23082000,
                    'total_econ_cls_transfers': 23082000
                },
                '1998': {
                    'amounts_allocated': 0,
                    'amounts_executed': 0,
                    'amounts_revised': 0,
                    'code_titles': [
                        '0020241447:תנועות נוער - השתתפות והחזקה - תמיכה'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 0,
                    'commitment_balance_executed': 1000000,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': 0,
                    'dedicated_revised': 0,
                    'depth': 4,
                    'gross_allocated': 0,
                    'gross_revised': 0,
                    'net_allocated': 26895000,
                    'net_executed': 28745397,
                    'net_revised': 31067000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 31067000,
                    'total_econ_cls_transfers': 31067000
                },
                '1999': {
                    'amounts_allocated': 0,
                    'amounts_executed': 0,
                    'amounts_revised': 0,
                    'code_titles': [
                        '0020241447:תנועות נוער - השתתפות והחזקה - תמיכה'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 0,
                    'commitment_balance_executed': 0,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': 0,
                    'dedicated_revised': 0,
                    'depth': 4,
                    'gross_allocated': 0,
                    'gross_revised': 0,
                    'net_allocated': 36660000,
                    'net_executed': 36663995,
                    'net_revised': 36664000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 36664000,
                    'total_econ_cls_transfers': 36664000
                },
                '2000': {
                    'amounts_allocated': 0,
                    'amounts_executed': 0,
                    'amounts_revised': 0,
                    'code_titles': [
                        '0020241447:תנועות נוער - השתתפות והחזקה - תמיכה'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 0,
                    'commitment_balance_executed': 413171,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': 0,
                    'dedicated_revised': 0,
                    'depth': 4,
                    'gross_allocated': 0,
                    'gross_revised': 0,
                    'net_allocated': 45847000,
                    'net_executed': 43889262,
                    'net_revised': 45847000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 45847000,
                    'total_econ_cls_transfers': 45847000
                },
                '2001': {
                    'amounts_allocated': 0,
                    'amounts_executed': 0,
                    'amounts_revised': 0,
                    'code_titles': [
                        '0020241447:תנועות נוער - השתתפות והחזקה - תמיכה'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 0,
                    'commitment_balance_executed': 962461,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': 0,
                    'dedicated_revised': 0,
                    'depth': 4,
                    'gross_allocated': 0,
                    'gross_revised': 0,
                    'net_allocated': 46422000,
                    'net_executed': 65820535,
                    'net_revised': 66783000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 66783000,
                    'total_econ_cls_transfers': 66783000
                },
                '2002': {
                    'amounts_allocated': 0,
                    'amounts_executed': 0,
                    'amounts_revised': 0,
                    'code_titles': [
                        '0020241447:תנועות נוער - השתתפות והחזקה - תמיכה'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 0,
                    'commitment_balance_executed': 80419,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': 0,
                    'dedicated_revised': 0,
                    'depth': 4,
                    'gross_allocated': 0,
                    'gross_revised': 0,
                    'net_allocated': 45812000,
                    'net_executed': 55140340,
                    'net_revised': 55524000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 55524000,
                    'total_econ_cls_transfers': 55524000
                },
                '2003': {
                    'amounts_allocated': 0,
                    'amounts_executed': 0,
                    'amounts_revised': 0,
                    'code_titles': [
                        '0020241447:תנועות נוער - השתתפות והחזקה - תמיכה'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 0,
                    'commitment_balance_executed': 1011180,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': 0,
                    'dedicated_revised': 0,
                    'depth': 4,
                    'gross_allocated': 0,
                    'gross_revised': 0,
                    'net_allocated': 32468000,
                    'net_executed': 56497624,
                    'net_revised': 57718000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 57718000,
                    'total_econ_cls_transfers': 57718000
                },
                '2004': {
                    'amounts_allocated': 0,
                    'amounts_executed': 0,
                    'amounts_revised': 0,
                    'code_titles': [
                        '0020241447:תנועות נוער - השתתפות והחזקה - תמיכה'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 0,
                    'commitment_balance_executed': 22438,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': 0,
                    'dedicated_revised': 0,
                    'depth': 4,
                    'gross_allocated': 0,
                    'gross_revised': 0,
                    'net_allocated': 36494000,
                    'net_executed': 51883992,
                    'net_revised': 52013000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 52013000,
                    'total_econ_cls_transfers': 52013000
                },
                '2005': {
                    'amounts_allocated': 0,
                    'amounts_executed': 0,
                    'amounts_revised': 0,
                    'code_titles': [
                        '0020241447:תנועות נוער - השתתפות והחזקה - תמיכה'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 0,
                    'commitment_balance_executed': 484931,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': 0,
                    'dedicated_revised': 0,
                    'depth': 4,
                    'gross_allocated': 0,
                    'gross_revised': 0,
                    'net_allocated': 35574000,
                    'net_executed': 53550439,
                    'net_revised': 54605000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 54605000,
                    'total_econ_cls_transfers': 54605000
                },
                '2006': {
                    'amounts_allocated': 0,
                    'amounts_executed': 0,
                    'amounts_revised': 0,
                    'code_titles': [
                        '0020241447:תנועות נוער - השתתפות והחזקה - תמיכה'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 0,
                    'commitment_balance_executed': 2722918,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': 0,
                    'dedicated_revised': 0,
                    'depth': 4,
                    'gross_allocated': 0,
                    'gross_revised': 0,
                    'net_allocated': 33944000,
                    'net_executed': 47517359,
                    'net_revised': 50711000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 50711000,
                    'total_econ_cls_transfers': 50711000
                },
                '2007': {
                    'amounts_allocated': 0,
                    'amounts_executed': 0,
                    'amounts_revised': 0,
                    'code_titles': [
                        '0020241447:תנועות נוער - השתתפות והחזקה - תמיכה'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 0,
                    'commitment_balance_executed': 1751681,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': 0,
                    'dedicated_revised': 0,
                    'depth': 4,
                    'gross_allocated': 0,
                    'gross_revised': 0,
                    'net_allocated': 48762000,
                    'net_executed': 74837775,
                    'net_revised': 76985000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 76985000,
                    'total_econ_cls_transfers': 76985000
                },
                '2008': {
                    'amounts_allocated': 0,
                    'amounts_executed': 0,
                    'amounts_revised': 0,
                    'code_titles': [
                        '0020241447:תנועות נוער - השתתפות והחזקה - תמיכה'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 0,
                    'commitment_balance_executed': 1220195,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': 0,
                    'dedicated_revised': 0,
                    'depth': 4,
                    'gross_allocated': 0,
                    'gross_revised': 0,
                    'net_allocated': 39185000,
                    'net_executed': 71166609,
                    'net_revised': 72410000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 72410000,
                    'total_econ_cls_transfers': 72410000
                },
                '2009': {
                    'amounts_allocated': 0,
                    'amounts_executed': 0,
                    'amounts_revised': 0,
                    'code_titles': [
                        '0020241447:תנועות נוער - השתתפות והחזקה - תמיכה'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 0,
                    'commitment_balance_executed': 1928802,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': 0,
                    'dedicated_revised': 0,
                    'depth': 4,
                    'gross_allocated': 0,
                    'gross_revised': 0,
                    'net_allocated': 64480000,
                    'net_executed': 66814153,
                    'net_revised': 68900000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 68900000,
                    'total_econ_cls_transfers': 68900000
                },
                '2010': {
                    'amounts_allocated': 0,
                    'amounts_executed': 0,
                    'amounts_revised': 0,
                    'code_titles': [
                        '0020241447:תנועות נוער - השתתפות והחזקה - תמיכה'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 0,
                    'commitment_balance_executed': 2029951,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': 0,
                    'dedicated_revised': 0,
                    'depth': 4,
                    'gross_allocated': 0,
                    'gross_revised': 0,
                    'net_allocated': 59989000,
                    'net_executed': 68614952,
                    'net_revised': 70659000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 70659000,
                    'total_econ_cls_transfers': 70659000
                },
                '2011': {
                    'amounts_allocated': 0,
                    'amounts_executed': 0,
                    'amounts_revised': 0,
                    'code_titles': [
                        '0020241447:תנועות נוער - השתתפות והחזקה - תמיכה'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 0,
                    'commitment_balance_executed': 4403940,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': 0,
                    'dedicated_revised': 0,
                    'depth': 4,
                    'gross_allocated': 0,
                    'gross_revised': 0,
                    'net_allocated': 64424000,
                    'net_executed': 74141932,
                    'net_revised': 78614000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 78614000,
                    'total_econ_cls_transfers': 78614000
                },
                '2012': {
                    'amounts_allocated': 0,
                    'amounts_executed': 0,
                    'amounts_revised': 0,
                    'code_titles': [
                        '0020241447:תנועות נוער - השתתפות והחזקה - תמיכה'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 0,
                    'commitment_balance_executed': 6553880,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': 0,
                    'dedicated_revised': 0,
                    'depth': 4,
                    'gross_allocated': 0,
                    'gross_revised': 0,
                    'net_allocated': 64097000,
                    'net_executed': 88546994,
                    'net_revised': 95101000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 95101000,
                    'total_econ_cls_transfers': 95101000
                },
                '2013': {
                    'amounts_allocated': 0,
                    'amounts_executed': 0,
                    'amounts_revised': 0,
                    'code_titles': [
                        '0020241447:תנועות נוער - השתתפות והחזקה - תמיכה'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 0,
                    'commitment_balance_executed': 5261701,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': 0,
                    'dedicated_revised': 0,
                    'depth': 4,
                    'gross_allocated': 0,
                    'gross_revised': 0,
                    'net_allocated': 84653000,
                    'net_executed': 89545129,
                    'net_revised': 94807000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 94807000,
                    'total_econ_cls_transfers': 94807000
                },
                '2014': {
                    'amounts_allocated': 0,
                    'amounts_executed': 0,
                    'amounts_revised': 0,
                    'code_titles': [
                        '0020241447:תנועות נוער - השתתפות והחזקה - תמיכה'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 0,
                    'commitment_balance_executed': 9430348,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': 0,
                    'dedicated_revised': 0,
                    'depth': 4,
                    'gross_allocated': 0,
                    'gross_revised': 0,
                    'net_allocated': 85093000,
                    'net_executed': 88838100,
                    'net_revised': 98873000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 98873000,
                    'total_econ_cls_transfers': 98873000
                },
                '2015': {
                    'amounts_allocated': 0,
                    'amounts_executed': 0,
                    'amounts_revised': 0,
                    'code_titles': [
                        '0020460418:תמיכה בתנועות נוער'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 0,
                    'commitment_balance_executed': 2643776,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': 0,
                    'dedicated_revised': 0,
                    'depth': 4,
                    'gross_allocated': 0,
                    'gross_revised': 0,
                    'net_allocated': 87599000,
                    'net_executed': 96485053,
                    'net_revised': 99135000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 99135000,
                    'total_econ_cls_transfers': 99135000
                },
                '2016': {
                    'amounts_allocated': 0,
                    'amounts_executed': 0,
                    'amounts_revised': 0,
                    'code_titles': [
                        '0020460418:תמיכה בתנועות נוער'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 0,
                    'commitment_balance_executed': 6929610,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': 0,
                    'dedicated_revised': 0,
                    'depth': 4,
                    'gross_allocated': 0,
                    'gross_revised': 0,
                    'net_allocated': 97622000,
                    'net_executed': 98274638,
                    'net_revised': 105873000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 105873000,
                    'total_econ_cls_transfers': 105873000
                },
                '2017': {
                    'amounts_allocated': 0,
                    'amounts_executed': 0,
                    'amounts_revised': 0,
                    'code_titles': [
                        '0020460418:תמיכה בתנועות נוער'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_executed': 0,
                    'commitment_allowance_revised': 0,
                    'commitment_balance_executed': 9672174,
                    'contractors_allocated': 0,
                    'contractors_executed': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': 0,
                    'dedicated_revised': 0,
                    'depth': 4,
                    'gross_allocated': 0,
                    'gross_revised': 0,
                    'net_allocated': 97901000,
                    'net_executed': 108950826,
                    'net_revised': 118623000,
                    'personnel_allocated': 0,
                    'personnel_executed': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 118623000,
                    'total_econ_cls_transfers': 118623000
                },
                '2018': {
                    'amounts_allocated': 0,
                    'amounts_revised': 0,
                    'code_titles': [
                        '0020460418:תמיכה בתנועות נוער'
                    ],
                    'commitment_allowance_allocated': 0,
                    'commitment_allowance_revised': 0,
                    'contractors_allocated': 0,
                    'contractors_revised': 0,
                    'dedicated_allocated': 0,
                    'dedicated_revised': 0,
                    'depth': 4,
                    'gross_allocated': 0,
                    'gross_revised': 0,
                    'net_allocated': 98665000,
                    'net_revised': 98665000,
                    'personnel_allocated': 0,
                    'personnel_revised': 0,
                    'total_direction_expense': 98665000,
                    'total_econ_cls_transfers': 98665000
                }
            },
            'net_allocated': 110163000,
            'net_executed': null,
            'net_revised': 110163000,
            'nice-breadcrumbs': '1997 - 2019 / משרד החינוך / תכניות חינוכיות משלימות / חינוך ' +
'בלתי פורמאלי',
            'nice-category': 'שירותים חברתיים / חינוך',
            'nice-code': '20.46.04.18',
            'nice-econ-category': 'העברות-תמיכות לפי סעיף 3א',
            'non_repeating': [
                0
            ],
            'page_title': 'תקציב תמיכה בתנועות נוער (20.46.04.18)',
            'parent': '00204604',
            'personnel_allocated': 0,
            'personnel_executed': null,
            'personnel_revised': 0,
            'rev_last_modified_at': '2018-12-02',
            'rev_last_updated_at': '2018-12-02',
            'score': 110163,
            'semantic_tags': [],
            'simple-code': '20460418',
            'title': 'תמיכה בתנועות נוער',
            'total_direction_expense': 110163000,
            'total_direction_income': null,
            'total_econ_cls_capital_expenditure': null,
            'total_econ_cls_credit': null,
            'total_econ_cls_debt_repayment_interest': null,
            'total_econ_cls_debt_repayment_principal': null,
            'total_econ_cls_dedicated_income': null,
            'total_econ_cls_income': null,
            'total_econ_cls_income_bank_of_israel': null,
            'total_econ_cls_income_grants': null,
            'total_econ_cls_income_loans': null,
            'total_econ_cls_interim_accounts': null,
            'total_econ_cls_internal_transfers': null,
            'total_econ_cls_investment': null,
            'total_econ_cls_procurement': null,
            'total_econ_cls_reserve': null,
            'total_econ_cls_salaries': null,
            'total_econ_cls_transfers': 110163000,
            'year': 2019
        }
    ],
    'explanations': [
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
    ]
};
